Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x55e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x85ebb): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x4f25d): ../Core/Src/eeprom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x46d21): C:/Users/brech/STM32CubeIDE/workspace_1.14.0/Aether_Update/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x64a4d): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x813a): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x60c13): unsigned char
 <1><44>: Abbrev Number: 2 (DW_TAG_typedef)
    <45>   DW_AT_name        : (indirect string, offset: 0x79d2e): __int16_t
    <49>   DW_AT_decl_file   : 2
    <4a>   DW_AT_decl_line   : 55
    <4b>   DW_AT_decl_column : 24
    <4c>   DW_AT_type        : <0x50>
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x5179): short int
 <1><57>: Abbrev Number: 2 (DW_TAG_typedef)
    <58>   DW_AT_name        : (indirect string, offset: 0x6ca85): __uint16_t
    <5c>   DW_AT_decl_file   : 2
    <5d>   DW_AT_decl_line   : 57
    <5e>   DW_AT_decl_column : 25
    <5f>   DW_AT_type        : <0x63>
 <1><63>: Abbrev Number: 3 (DW_TAG_base_type)
    <64>   DW_AT_byte_size   : 2
    <65>   DW_AT_encoding    : 7	(unsigned)
    <66>   DW_AT_name        : (indirect string, offset: 0x4388c): short unsigned int
 <1><6a>: Abbrev Number: 3 (DW_TAG_base_type)
    <6b>   DW_AT_byte_size   : 4
    <6c>   DW_AT_encoding    : 5	(signed)
    <6d>   DW_AT_name        : (indirect string, offset: 0x1ad5b): long int
 <1><71>: Abbrev Number: 2 (DW_TAG_typedef)
    <72>   DW_AT_name        : (indirect string, offset: 0x3b1e7): __uint32_t
    <76>   DW_AT_decl_file   : 2
    <77>   DW_AT_decl_line   : 79
    <78>   DW_AT_decl_column : 25
    <79>   DW_AT_type        : <0x7d>
 <1><7d>: Abbrev Number: 3 (DW_TAG_base_type)
    <7e>   DW_AT_byte_size   : 4
    <7f>   DW_AT_encoding    : 7	(unsigned)
    <80>   DW_AT_name        : (indirect string, offset: 0x4f28a): long unsigned int
 <1><84>: Abbrev Number: 3 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 8
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x35b42): long long int
 <1><8b>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x96f1): __uint64_t
    <90>   DW_AT_decl_file   : 2
    <91>   DW_AT_decl_line   : 105
    <92>   DW_AT_decl_column : 25
    <93>   DW_AT_type        : <0x97>
 <1><97>: Abbrev Number: 3 (DW_TAG_base_type)
    <98>   DW_AT_byte_size   : 8
    <99>   DW_AT_encoding    : 7	(unsigned)
    <9a>   DW_AT_name        : (indirect string, offset: 0x2e16a): long long unsigned int
 <1><9e>: Abbrev Number: 15 (DW_TAG_base_type)
    <9f>   DW_AT_byte_size   : 4
    <a0>   DW_AT_encoding    : 5	(signed)
    <a1>   DW_AT_name        : int
 <1><a5>: Abbrev Number: 3 (DW_TAG_base_type)
    <a6>   DW_AT_byte_size   : 4
    <a7>   DW_AT_encoding    : 7	(unsigned)
    <a8>   DW_AT_name        : (indirect string, offset: 0x48b3e): unsigned int
 <1><ac>: Abbrev Number: 2 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x813c): uint8_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 24
    <b3>   DW_AT_decl_column : 19
    <b4>   DW_AT_type        : <0x31>
 <1><b8>: Abbrev Number: 2 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x79d30): int16_t
    <bd>   DW_AT_decl_file   : 3
    <be>   DW_AT_decl_line   : 32
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x44>
 <1><c4>: Abbrev Number: 2 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x8a805): uint16_t
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 36
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x57>
 <1><d0>: Abbrev Number: 2 (DW_TAG_typedef)
    <d1>   DW_AT_name        : (indirect string, offset: 0x8a7e5): uint32_t
    <d5>   DW_AT_decl_file   : 3
    <d6>   DW_AT_decl_line   : 48
    <d7>   DW_AT_decl_column : 20
    <d8>   DW_AT_type        : <0x71>
 <1><dc>: Abbrev Number: 2 (DW_TAG_typedef)
    <dd>   DW_AT_name        : (indirect string, offset: 0x96f3): uint64_t
    <e1>   DW_AT_decl_file   : 3
    <e2>   DW_AT_decl_line   : 60
    <e3>   DW_AT_decl_column : 20
    <e4>   DW_AT_type        : <0x8b>
 <1><e8>: Abbrev Number: 3 (DW_TAG_base_type)
    <e9>   DW_AT_byte_size   : 8
    <ea>   DW_AT_encoding    : 4	(float)
    <eb>   DW_AT_name        : (indirect string, offset: 0x8b082): long double
 <1><ef>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <f0>   DW_AT_encoding    : 7	(unsigned)
    <f1>   DW_AT_byte_size   : 1
    <f2>   DW_AT_type        : <0x3d>
    <f6>   DW_AT_decl_file   : 4
    <f7>   DW_AT_decl_line   : 39
    <f8>   DW_AT_decl_column : 1
    <f9>   DW_AT_sibling     : <0x116>
 <2><fd>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fe>   DW_AT_name        : (indirect string, offset: 0x32417): HAL_OK
    <102>   DW_AT_const_value : 0
 <2><103>: Abbrev Number: 8 (DW_TAG_enumerator)
    <104>   DW_AT_name        : (indirect string, offset: 0x21be7): HAL_ERROR
    <108>   DW_AT_const_value : 1
 <2><109>: Abbrev Number: 8 (DW_TAG_enumerator)
    <10a>   DW_AT_name        : (indirect string, offset: 0x1fcde): HAL_BUSY
    <10e>   DW_AT_const_value : 2
 <2><10f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <110>   DW_AT_name        : (indirect string, offset: 0x3be7): HAL_TIMEOUT
    <114>   DW_AT_const_value : 3
 <2><115>: Abbrev Number: 0
 <1><116>: Abbrev Number: 2 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x7ef48): HAL_StatusTypeDef
    <11b>   DW_AT_decl_file   : 4
    <11c>   DW_AT_decl_line   : 44
    <11d>   DW_AT_decl_column : 3
    <11e>   DW_AT_type        : <0xef>
 <1><122>: Abbrev Number: 17 (DW_TAG_structure_type)
    <123>   DW_AT_byte_size   : 20
    <124>   DW_AT_decl_file   : 5
    <125>   DW_AT_decl_line   : 45
    <126>   DW_AT_decl_column : 9
    <127>   DW_AT_sibling     : <0x163>
 <2><12b>: Abbrev Number: 6 (DW_TAG_member)
    <12c>   DW_AT_name        : (indirect string, offset: 0x1a72f): TypeErase
    <130>   DW_AT_decl_file   : 5
    <130>   DW_AT_decl_line   : 47
    <131>   DW_AT_decl_column : 12
    <131>   DW_AT_type        : <0xd0>
    <135>   DW_AT_data_member_location: 0
 <2><136>: Abbrev Number: 6 (DW_TAG_member)
    <137>   DW_AT_name        : (indirect string, offset: 0x21df9): Banks
    <13b>   DW_AT_decl_file   : 5
    <13b>   DW_AT_decl_line   : 50
    <13c>   DW_AT_decl_column : 12
    <13c>   DW_AT_type        : <0xd0>
    <140>   DW_AT_data_member_location: 4
 <2><141>: Abbrev Number: 6 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0x94b3b): Sector
    <146>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 53
    <147>   DW_AT_decl_column : 12
    <147>   DW_AT_type        : <0xd0>
    <14b>   DW_AT_data_member_location: 8
 <2><14c>: Abbrev Number: 6 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x6df91): NbSectors
    <151>   DW_AT_decl_file   : 5
    <151>   DW_AT_decl_line   : 56
    <152>   DW_AT_decl_column : 12
    <152>   DW_AT_type        : <0xd0>
    <156>   DW_AT_data_member_location: 12
 <2><157>: Abbrev Number: 6 (DW_TAG_member)
    <158>   DW_AT_name        : (indirect string, offset: 0x2dfd9): VoltageRange
    <15c>   DW_AT_decl_file   : 5
    <15c>   DW_AT_decl_line   : 59
    <15d>   DW_AT_decl_column : 12
    <15d>   DW_AT_type        : <0xd0>
    <161>   DW_AT_data_member_location: 16
 <2><162>: Abbrev Number: 0
 <1><163>: Abbrev Number: 2 (DW_TAG_typedef)
    <164>   DW_AT_name        : (indirect string, offset: 0x4caa5): FLASH_EraseInitTypeDef
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 62
    <16a>   DW_AT_decl_column : 3
    <16b>   DW_AT_type        : <0x122>
 <1><16f>: Abbrev Number: 18 (DW_TAG_variable)
    <170>   DW_AT_name        : (indirect string, offset: 0x36e85): DataVar
    <174>   DW_AT_decl_file   : 1
    <175>   DW_AT_decl_line   : 58
    <176>   DW_AT_decl_column : 10
    <177>   DW_AT_type        : <0xc4>
    <17b>   DW_AT_external    : 1
    <17b>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><181>: Abbrev Number: 19 (DW_TAG_array_type)
    <182>   DW_AT_type        : <0xc4>
    <186>   DW_AT_sibling     : <0x191>
 <2><18a>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <18b>   DW_AT_type        : <0xa5>
    <18f>   DW_AT_upper_bound : 49
 <2><190>: Abbrev Number: 0
 <1><191>: Abbrev Number: 21 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x4ae4d): VirtAddVarTab
    <196>   DW_AT_decl_file   : 1
    <197>   DW_AT_decl_line   : 61
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0x181>
    <19d>   DW_AT_external    : 1
    <19d>   DW_AT_declaration : 1
 <1><19d>: Abbrev Number: 11 (DW_TAG_subprogram)
    <19e>   DW_AT_external    : 1
    <19e>   DW_AT_name        : (indirect string, offset: 0x749f5): HAL_FLASH_Program
    <1a2>   DW_AT_decl_file   : 6
    <1a3>   DW_AT_decl_line   : 306
    <1a5>   DW_AT_decl_column : 19
    <1a5>   DW_AT_prototyped  : 1
    <1a5>   DW_AT_type        : <0x116>
    <1a9>   DW_AT_declaration : 1
    <1a9>   DW_AT_sibling     : <0x1bd>
 <2><1ad>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1ae>   DW_AT_type        : <0xd0>
 <2><1b2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1b3>   DW_AT_type        : <0xd0>
 <2><1b7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1b8>   DW_AT_type        : <0xdc>
 <2><1bc>: Abbrev Number: 0
 <1><1bd>: Abbrev Number: 11 (DW_TAG_subprogram)
    <1be>   DW_AT_external    : 1
    <1be>   DW_AT_name        : (indirect string, offset: 0x79275): HAL_FLASHEx_Erase
    <1c2>   DW_AT_decl_file   : 5
    <1c3>   DW_AT_decl_line   : 725
    <1c5>   DW_AT_decl_column : 19
    <1c5>   DW_AT_prototyped  : 1
    <1c5>   DW_AT_type        : <0x116>
    <1c9>   DW_AT_declaration : 1
    <1c9>   DW_AT_sibling     : <0x1d8>
 <2><1cd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1ce>   DW_AT_type        : <0x1d8>
 <2><1d2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1d3>   DW_AT_type        : <0x1dd>
 <2><1d7>: Abbrev Number: 0
 <1><1d8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1d9>   DW_AT_byte_size   : 4
    <1d9>   DW_AT_type        : <0x163>
 <1><1dd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1de>   DW_AT_byte_size   : 4
    <1de>   DW_AT_type        : <0xd0>
 <1><1e2>: Abbrev Number: 10 (DW_TAG_subprogram)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x324bd): EE_PageTransfer
    <1e7>   DW_AT_decl_file   : 1
    <1e7>   DW_AT_decl_line   : 638
    <1e9>   DW_AT_decl_column : 17
    <1ea>   DW_AT_prototyped  : 1
    <1ea>   DW_AT_type        : <0xc4>
    <1ee>   DW_AT_low_pc      : 0x800cac0
    <1f2>   DW_AT_high_pc     : 0x178
    <1f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1f8>   DW_AT_call_all_tail_calls: 1
    <1f8>   DW_AT_sibling     : <0x2a2>
 <2><1fc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x40761): VirtAddress
    <201>   DW_AT_decl_file   : 1
    <201>   DW_AT_decl_line   : 638
    <203>   DW_AT_decl_column : 42
    <204>   DW_AT_type        : <0xc4>
    <208>   DW_AT_location    : 2 byte block: 91 4e 	(DW_OP_fbreg: -50)
 <2><20b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <20c>   DW_AT_name        : (indirect string, offset: 0x93e58): Data
    <210>   DW_AT_decl_file   : 1
    <210>   DW_AT_decl_line   : 638
    <212>   DW_AT_decl_column : 64
    <213>   DW_AT_type        : <0xc4>
    <217>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><21a>: Abbrev Number: 1 (DW_TAG_variable)
    <21b>   DW_AT_name        : (indirect string, offset: 0x4a376): FlashStatus
    <21f>   DW_AT_decl_file   : 1
    <21f>   DW_AT_decl_line   : 640
    <221>   DW_AT_decl_column : 21
    <222>   DW_AT_type        : <0x116>
    <226>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><229>: Abbrev Number: 1 (DW_TAG_variable)
    <22a>   DW_AT_name        : (indirect string, offset: 0x3d2a6): NewPageAddress
    <22e>   DW_AT_decl_file   : 1
    <22e>   DW_AT_decl_line   : 641
    <230>   DW_AT_decl_column : 12
    <231>   DW_AT_type        : <0xd0>
    <235>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><238>: Abbrev Number: 1 (DW_TAG_variable)
    <239>   DW_AT_name        : (indirect string, offset: 0x59eb5): OldPageId
    <23d>   DW_AT_decl_file   : 1
    <23d>   DW_AT_decl_line   : 642
    <23f>   DW_AT_decl_column : 12
    <240>   DW_AT_type        : <0xc4>
    <244>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><247>: Abbrev Number: 1 (DW_TAG_variable)
    <248>   DW_AT_name        : (indirect string, offset: 0x43046): ValidPage
    <24c>   DW_AT_decl_file   : 1
    <24c>   DW_AT_decl_line   : 643
    <24e>   DW_AT_decl_column : 12
    <24f>   DW_AT_type        : <0xc4>
    <253>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><256>: Abbrev Number: 1 (DW_TAG_variable)
    <257>   DW_AT_name        : (indirect string, offset: 0x79774): VarIdx
    <25b>   DW_AT_decl_file   : 1
    <25b>   DW_AT_decl_line   : 643
    <25d>   DW_AT_decl_column : 31
    <25e>   DW_AT_type        : <0xc4>
    <262>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><265>: Abbrev Number: 1 (DW_TAG_variable)
    <266>   DW_AT_name        : (indirect string, offset: 0x38a25): EepromStatus
    <26a>   DW_AT_decl_file   : 1
    <26a>   DW_AT_decl_line   : 644
    <26c>   DW_AT_decl_column : 12
    <26d>   DW_AT_type        : <0xc4>
    <271>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><274>: Abbrev Number: 1 (DW_TAG_variable)
    <275>   DW_AT_name        : (indirect string, offset: 0x7bfdc): ReadStatus
    <279>   DW_AT_decl_file   : 1
    <279>   DW_AT_decl_line   : 644
    <27b>   DW_AT_decl_column : 30
    <27c>   DW_AT_type        : <0xc4>
    <280>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><283>: Abbrev Number: 1 (DW_TAG_variable)
    <284>   DW_AT_name        : (indirect string, offset: 0x277c1): SectorError
    <288>   DW_AT_decl_file   : 1
    <288>   DW_AT_decl_line   : 645
    <28a>   DW_AT_decl_column : 12
    <28b>   DW_AT_type        : <0xd0>
    <28f>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><292>: Abbrev Number: 1 (DW_TAG_variable)
    <293>   DW_AT_name        : (indirect string, offset: 0x7bfd1): pEraseInit
    <297>   DW_AT_decl_file   : 1
    <297>   DW_AT_decl_line   : 646
    <299>   DW_AT_decl_column : 26
    <29a>   DW_AT_type        : <0x163>
    <29e>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><2a1>: Abbrev Number: 0
 <1><2a2>: Abbrev Number: 10 (DW_TAG_subprogram)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x590b7): EE_VerifyPageFullWriteVariable
    <2a7>   DW_AT_decl_file   : 1
    <2a7>   DW_AT_decl_line   : 577
    <2a9>   DW_AT_decl_column : 17
    <2aa>   DW_AT_prototyped  : 1
    <2aa>   DW_AT_type        : <0xc4>
    <2ae>   DW_AT_low_pc      : 0x800c9fc
    <2b2>   DW_AT_high_pc     : 0xc4
    <2b6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2b8>   DW_AT_call_all_tail_calls: 1
    <2b8>   DW_AT_sibling     : <0x317>
 <2><2bc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x40761): VirtAddress
    <2c1>   DW_AT_decl_file   : 1
    <2c1>   DW_AT_decl_line   : 577
    <2c3>   DW_AT_decl_column : 57
    <2c4>   DW_AT_type        : <0xc4>
    <2c8>   DW_AT_location    : 2 byte block: 91 56 	(DW_OP_fbreg: -42)
 <2><2cb>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x93e58): Data
    <2d0>   DW_AT_decl_file   : 1
    <2d0>   DW_AT_decl_line   : 577
    <2d2>   DW_AT_decl_column : 79
    <2d3>   DW_AT_type        : <0xc4>
    <2d7>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><2da>: Abbrev Number: 1 (DW_TAG_variable)
    <2db>   DW_AT_name        : (indirect string, offset: 0x4a376): FlashStatus
    <2df>   DW_AT_decl_file   : 1
    <2df>   DW_AT_decl_line   : 579
    <2e1>   DW_AT_decl_column : 21
    <2e2>   DW_AT_type        : <0x116>
    <2e6>   DW_AT_location    : 2 byte block: 91 63 	(DW_OP_fbreg: -29)
 <2><2e9>: Abbrev Number: 1 (DW_TAG_variable)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x43046): ValidPage
    <2ee>   DW_AT_decl_file   : 1
    <2ee>   DW_AT_decl_line   : 580
    <2f0>   DW_AT_decl_column : 12
    <2f1>   DW_AT_type        : <0xc4>
    <2f5>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><2f8>: Abbrev Number: 1 (DW_TAG_variable)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x4bb72): Address
    <2fd>   DW_AT_decl_file   : 1
    <2fd>   DW_AT_decl_line   : 581
    <2ff>   DW_AT_decl_column : 12
    <300>   DW_AT_type        : <0xd0>
    <304>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><307>: Abbrev Number: 1 (DW_TAG_variable)
    <308>   DW_AT_name        : (indirect string, offset: 0x4bb6b): PageEndAddress
    <30c>   DW_AT_decl_file   : 1
    <30c>   DW_AT_decl_line   : 581
    <30e>   DW_AT_decl_column : 44
    <30f>   DW_AT_type        : <0xd0>
    <313>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><316>: Abbrev Number: 0
 <1><317>: Abbrev Number: 12 (DW_TAG_subprogram)
    <318>   DW_AT_name        : (indirect string, offset: 0x4303f): EE_FindValidPage
    <31c>   DW_AT_decl_file   : 1
    <31c>   DW_AT_decl_line   : 505
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_prototyped  : 1
    <31f>   DW_AT_type        : <0xc4>
    <323>   DW_AT_low_pc      : 0x800c970
    <327>   DW_AT_high_pc     : 0x8c
    <32b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <32d>   DW_AT_call_all_calls: 1
    <32d>   DW_AT_sibling     : <0x35f>
 <2><331>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <332>   DW_AT_name        : (indirect string, offset: 0x94a71): Operation
    <336>   DW_AT_decl_file   : 1
    <336>   DW_AT_decl_line   : 505
    <338>   DW_AT_decl_column : 42
    <339>   DW_AT_type        : <0xac>
    <33d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><340>: Abbrev Number: 1 (DW_TAG_variable)
    <341>   DW_AT_name        : (indirect string, offset: 0x55db8): PageStatus0
    <345>   DW_AT_decl_file   : 1
    <345>   DW_AT_decl_line   : 507
    <347>   DW_AT_decl_column : 12
    <348>   DW_AT_type        : <0xc4>
    <34c>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><34f>: Abbrev Number: 1 (DW_TAG_variable)
    <350>   DW_AT_name        : (indirect string, offset: 0x55dc4): PageStatus1
    <354>   DW_AT_decl_file   : 1
    <354>   DW_AT_decl_line   : 507
    <356>   DW_AT_decl_column : 29
    <357>   DW_AT_type        : <0xc4>
    <35b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><35e>: Abbrev Number: 0
 <1><35f>: Abbrev Number: 10 (DW_TAG_subprogram)
    <360>   DW_AT_name        : (indirect string, offset: 0x6c74a): EE_Format
    <364>   DW_AT_decl_file   : 1
    <364>   DW_AT_decl_line   : 453
    <366>   DW_AT_decl_column : 26
    <367>   DW_AT_prototyped  : 1
    <367>   DW_AT_type        : <0x116>
    <36b>   DW_AT_low_pc      : 0x800c8cc
    <36f>   DW_AT_high_pc     : 0xa4
    <373>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <375>   DW_AT_call_all_tail_calls: 1
    <375>   DW_AT_sibling     : <0x3a7>
 <2><379>: Abbrev Number: 1 (DW_TAG_variable)
    <37a>   DW_AT_name        : (indirect string, offset: 0x4a376): FlashStatus
    <37e>   DW_AT_decl_file   : 1
    <37e>   DW_AT_decl_line   : 455
    <380>   DW_AT_decl_column : 21
    <381>   DW_AT_type        : <0x116>
    <385>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><388>: Abbrev Number: 1 (DW_TAG_variable)
    <389>   DW_AT_name        : (indirect string, offset: 0x277c1): SectorError
    <38d>   DW_AT_decl_file   : 1
    <38d>   DW_AT_decl_line   : 456
    <38f>   DW_AT_decl_column : 12
    <390>   DW_AT_type        : <0xd0>
    <394>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><397>: Abbrev Number: 1 (DW_TAG_variable)
    <398>   DW_AT_name        : (indirect string, offset: 0x7bfd1): pEraseInit
    <39c>   DW_AT_decl_file   : 1
    <39c>   DW_AT_decl_line   : 457
    <39e>   DW_AT_decl_column : 26
    <39f>   DW_AT_type        : <0x163>
    <3a3>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 13 (DW_TAG_subprogram)
    <3a8>   DW_AT_external    : 1
    <3a8>   DW_AT_name        : (indirect string, offset: 0x794f8): EE_WriteVariable
    <3ac>   DW_AT_decl_file   : 1
    <3ac>   DW_AT_decl_line   : 429
    <3ae>   DW_AT_decl_column : 10
    <3ae>   DW_AT_prototyped  : 1
    <3ae>   DW_AT_type        : <0xc4>
    <3b2>   DW_AT_low_pc      : 0x800c888
    <3b6>   DW_AT_high_pc     : 0x44
    <3ba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3bc>   DW_AT_call_all_tail_calls: 1
    <3bc>   DW_AT_sibling     : <0x3ee>
 <2><3c0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x40761): VirtAddress
    <3c5>   DW_AT_decl_file   : 1
    <3c5>   DW_AT_decl_line   : 429
    <3c7>   DW_AT_decl_column : 36
    <3c8>   DW_AT_type        : <0xc4>
    <3cc>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><3cf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x93e58): Data
    <3d4>   DW_AT_decl_file   : 1
    <3d4>   DW_AT_decl_line   : 429
    <3d6>   DW_AT_decl_column : 58
    <3d7>   DW_AT_type        : <0xc4>
    <3db>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><3de>: Abbrev Number: 1 (DW_TAG_variable)
    <3df>   DW_AT_name        : (indirect string, offset: 0x97928): Status
    <3e3>   DW_AT_decl_file   : 1
    <3e3>   DW_AT_decl_line   : 431
    <3e5>   DW_AT_decl_column : 12
    <3e6>   DW_AT_type        : <0xc4>
    <3ea>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><3ed>: Abbrev Number: 0
 <1><3ee>: Abbrev Number: 13 (DW_TAG_subprogram)
    <3ef>   DW_AT_external    : 1
    <3ef>   DW_AT_name        : (indirect string, offset: 0x85064): EE_ReadVariable
    <3f3>   DW_AT_decl_file   : 1
    <3f3>   DW_AT_decl_line   : 370
    <3f5>   DW_AT_decl_column : 10
    <3f5>   DW_AT_prototyped  : 1
    <3f5>   DW_AT_type        : <0xc4>
    <3f9>   DW_AT_low_pc      : 0x800c7f4
    <3fd>   DW_AT_high_pc     : 0x94
    <401>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <403>   DW_AT_call_all_tail_calls: 1
    <403>   DW_AT_sibling     : <0x471>
 <2><407>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <408>   DW_AT_name        : (indirect string, offset: 0x40761): VirtAddress
    <40c>   DW_AT_decl_file   : 1
    <40c>   DW_AT_decl_line   : 370
    <40e>   DW_AT_decl_column : 35
    <40f>   DW_AT_type        : <0xc4>
    <413>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><416>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <417>   DW_AT_name        : (indirect string, offset: 0x93e58): Data
    <41b>   DW_AT_decl_file   : 1
    <41b>   DW_AT_decl_line   : 370
    <41d>   DW_AT_decl_column : 58
    <41e>   DW_AT_type        : <0x471>
    <422>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><425>: Abbrev Number: 1 (DW_TAG_variable)
    <426>   DW_AT_name        : (indirect string, offset: 0x43046): ValidPage
    <42a>   DW_AT_decl_file   : 1
    <42a>   DW_AT_decl_line   : 372
    <42c>   DW_AT_decl_column : 12
    <42d>   DW_AT_type        : <0xc4>
    <431>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><434>: Abbrev Number: 1 (DW_TAG_variable)
    <435>   DW_AT_name        : (indirect string, offset: 0x479ea): AddressValue
    <439>   DW_AT_decl_file   : 1
    <439>   DW_AT_decl_line   : 373
    <43b>   DW_AT_decl_column : 12
    <43c>   DW_AT_type        : <0xc4>
    <440>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><443>: Abbrev Number: 1 (DW_TAG_variable)
    <444>   DW_AT_name        : (indirect string, offset: 0x7bfdc): ReadStatus
    <448>   DW_AT_decl_file   : 1
    <448>   DW_AT_decl_line   : 373
    <44a>   DW_AT_decl_column : 35
    <44b>   DW_AT_type        : <0xc4>
    <44f>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><452>: Abbrev Number: 1 (DW_TAG_variable)
    <453>   DW_AT_name        : (indirect string, offset: 0x4bb72): Address
    <457>   DW_AT_decl_file   : 1
    <457>   DW_AT_decl_line   : 374
    <459>   DW_AT_decl_column : 12
    <45a>   DW_AT_type        : <0xd0>
    <45e>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><461>: Abbrev Number: 1 (DW_TAG_variable)
    <462>   DW_AT_name        : (indirect string, offset: 0x60029): PageStartAddress
    <466>   DW_AT_decl_file   : 1
    <466>   DW_AT_decl_line   : 374
    <468>   DW_AT_decl_column : 44
    <469>   DW_AT_type        : <0xd0>
    <46d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><470>: Abbrev Number: 0
 <1><471>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <472>   DW_AT_byte_size   : 4
    <472>   DW_AT_type        : <0xc4>
 <1><476>: Abbrev Number: 12 (DW_TAG_subprogram)
    <477>   DW_AT_name        : (indirect string, offset: 0x49147): EE_VerifyPageFullyErased
    <47b>   DW_AT_decl_file   : 1
    <47b>   DW_AT_decl_line   : 331
    <47d>   DW_AT_decl_column : 10
    <47e>   DW_AT_prototyped  : 1
    <47e>   DW_AT_type        : <0xc4>
    <482>   DW_AT_low_pc      : 0x800c7a0
    <486>   DW_AT_high_pc     : 0x52
    <48a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <48c>   DW_AT_call_all_calls: 1
    <48c>   DW_AT_sibling     : <0x4cd>
 <2><490>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <491>   DW_AT_name        : (indirect string, offset: 0x4bb72): Address
    <495>   DW_AT_decl_file   : 1
    <495>   DW_AT_decl_line   : 331
    <497>   DW_AT_decl_column : 44
    <498>   DW_AT_type        : <0xd0>
    <49c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><49f>: Abbrev Number: 1 (DW_TAG_variable)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x7bfdc): ReadStatus
    <4a4>   DW_AT_decl_file   : 1
    <4a4>   DW_AT_decl_line   : 333
    <4a6>   DW_AT_decl_column : 12
    <4a7>   DW_AT_type        : <0xd0>
    <4ab>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><4ae>: Abbrev Number: 1 (DW_TAG_variable)
    <4af>   DW_AT_name        : (indirect string, offset: 0x5844b): BeginAddress
    <4b3>   DW_AT_decl_file   : 1
    <4b3>   DW_AT_decl_line   : 334
    <4b5>   DW_AT_decl_column : 12
    <4b6>   DW_AT_type        : <0xd0>
    <4ba>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><4bd>: Abbrev Number: 1 (DW_TAG_variable)
    <4be>   DW_AT_name        : (indirect string, offset: 0x479ea): AddressValue
    <4c2>   DW_AT_decl_file   : 1
    <4c2>   DW_AT_decl_line   : 335
    <4c4>   DW_AT_decl_column : 12
    <4c5>   DW_AT_type        : <0xc4>
    <4c9>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><4cc>: Abbrev Number: 0
 <1><4cd>: Abbrev Number: 22 (DW_TAG_subprogram)
    <4ce>   DW_AT_external    : 1
    <4ce>   DW_AT_name        : (indirect string, offset: 0x3802c): EE_Init
    <4d2>   DW_AT_decl_file   : 1
    <4d3>   DW_AT_decl_line   : 78
    <4d4>   DW_AT_decl_column : 10
    <4d5>   DW_AT_prototyped  : 1
    <4d5>   DW_AT_type        : <0xc4>
    <4d9>   DW_AT_low_pc      : 0x800c3e0
    <4dd>   DW_AT_high_pc     : 0x3c0
    <4e1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4e3>   DW_AT_call_all_tail_calls: 1
 <2><4e3>: Abbrev Number: 5 (DW_TAG_variable)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x55db8): PageStatus0
    <4e8>   DW_AT_decl_file   : 1
    <4e8>   DW_AT_decl_line   : 80
    <4e9>   DW_AT_decl_column : 12
    <4ea>   DW_AT_type        : <0xc4>
    <4ee>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><4f1>: Abbrev Number: 5 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x55dc4): PageStatus1
    <4f6>   DW_AT_decl_file   : 1
    <4f6>   DW_AT_decl_line   : 80
    <4f7>   DW_AT_decl_column : 29
    <4f8>   DW_AT_type        : <0xc4>
    <4fc>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><4ff>: Abbrev Number: 5 (DW_TAG_variable)
    <500>   DW_AT_name        : (indirect string, offset: 0x79774): VarIdx
    <504>   DW_AT_decl_file   : 1
    <504>   DW_AT_decl_line   : 81
    <505>   DW_AT_decl_column : 12
    <506>   DW_AT_type        : <0xc4>
    <50a>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><50d>: Abbrev Number: 5 (DW_TAG_variable)
    <50e>   DW_AT_name        : (indirect string, offset: 0x38a25): EepromStatus
    <512>   DW_AT_decl_file   : 1
    <512>   DW_AT_decl_line   : 82
    <513>   DW_AT_decl_column : 12
    <514>   DW_AT_type        : <0xc4>
    <518>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><51b>: Abbrev Number: 5 (DW_TAG_variable)
    <51c>   DW_AT_name        : (indirect string, offset: 0x7bfdc): ReadStatus
    <520>   DW_AT_decl_file   : 1
    <520>   DW_AT_decl_line   : 82
    <521>   DW_AT_decl_column : 30
    <522>   DW_AT_type        : <0xc4>
    <526>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><529>: Abbrev Number: 23 (DW_TAG_variable)
    <52a>   DW_AT_name        : x
    <52c>   DW_AT_decl_file   : 1
    <52d>   DW_AT_decl_line   : 83
    <52e>   DW_AT_decl_column : 11
    <52f>   DW_AT_type        : <0xb8>
    <533>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><536>: Abbrev Number: 5 (DW_TAG_variable)
    <537>   DW_AT_name        : (indirect string, offset: 0x4a376): FlashStatus
    <53b>   DW_AT_decl_file   : 1
    <53b>   DW_AT_decl_line   : 84
    <53c>   DW_AT_decl_column : 22
    <53d>   DW_AT_type        : <0x116>
    <541>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><544>: Abbrev Number: 5 (DW_TAG_variable)
    <545>   DW_AT_name        : (indirect string, offset: 0x277c1): SectorError
    <549>   DW_AT_decl_file   : 1
    <549>   DW_AT_decl_line   : 85
    <54a>   DW_AT_decl_column : 12
    <54b>   DW_AT_type        : <0xd0>
    <54f>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><552>: Abbrev Number: 5 (DW_TAG_variable)
    <553>   DW_AT_name        : (indirect string, offset: 0x7bfd1): pEraseInit
    <557>   DW_AT_decl_file   : 1
    <557>   DW_AT_decl_line   : 86
    <558>   DW_AT_decl_column : 26
    <559>   DW_AT_type        : <0x163>
    <55d>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><560>: Abbrev Number: 0
 <1><561>: Abbrev Number: 0
  Compilation Unit @ offset 0x562:
   Length:        0x959 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x193
   Pointer Size:  4
 <0><56e>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <56f>   DW_AT_producer    : (indirect string, offset: 0x85ebb): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <573>   DW_AT_language    : 29	(C11)
    <574>   DW_AT_name        : (indirect string, offset: 0x8c43c): ../Core/Src/freertos.c
    <578>   DW_AT_comp_dir    : (indirect string, offset: 0x46d21): C:/Users/brech/STM32CubeIDE/workspace_1.14.0/Aether_Update/Debug
    <57c>   DW_AT_ranges      : 0x4f
    <580>   DW_AT_low_pc      : 0
    <584>   DW_AT_stmt_list   : 0xb5e
    <588>   DW_AT_macros      : 0x1426b
 <1><58c>: Abbrev Number: 20 (DW_TAG_base_type)
    <58d>   DW_AT_byte_size   : 4
    <58e>   DW_AT_encoding    : 5	(signed)
    <58f>   DW_AT_name        : int
 <1><593>: Abbrev Number: 6 (DW_TAG_base_type)
    <594>   DW_AT_byte_size   : 4
    <595>   DW_AT_encoding    : 7	(unsigned)
    <596>   DW_AT_name        : (indirect string, offset: 0x48b3e): unsigned int
 <1><59a>: Abbrev Number: 6 (DW_TAG_base_type)
    <59b>   DW_AT_byte_size   : 8
    <59c>   DW_AT_encoding    : 5	(signed)
    <59d>   DW_AT_name        : (indirect string, offset: 0x35b42): long long int
 <1><5a1>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a2>   DW_AT_byte_size   : 8
    <5a3>   DW_AT_encoding    : 4	(float)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x8b082): long double
 <1><5a8>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a9>   DW_AT_byte_size   : 1
    <5aa>   DW_AT_encoding    : 6	(signed char)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x64a4d): signed char
 <1><5af>: Abbrev Number: 5 (DW_TAG_typedef)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x813a): __uint8_t
    <5b4>   DW_AT_decl_file   : 2
    <5b5>   DW_AT_decl_line   : 43
    <5b6>   DW_AT_decl_column : 24
    <5b7>   DW_AT_type        : <0x5bb>
 <1><5bb>: Abbrev Number: 6 (DW_TAG_base_type)
    <5bc>   DW_AT_byte_size   : 1
    <5bd>   DW_AT_encoding    : 8	(unsigned char)
    <5be>   DW_AT_name        : (indirect string, offset: 0x60c13): unsigned char
 <1><5c2>: Abbrev Number: 6 (DW_TAG_base_type)
    <5c3>   DW_AT_byte_size   : 2
    <5c4>   DW_AT_encoding    : 5	(signed)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x5179): short int
 <1><5c9>: Abbrev Number: 5 (DW_TAG_typedef)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x6ca85): __uint16_t
    <5ce>   DW_AT_decl_file   : 2
    <5cf>   DW_AT_decl_line   : 57
    <5d0>   DW_AT_decl_column : 25
    <5d1>   DW_AT_type        : <0x5d5>
 <1><5d5>: Abbrev Number: 6 (DW_TAG_base_type)
    <5d6>   DW_AT_byte_size   : 2
    <5d7>   DW_AT_encoding    : 7	(unsigned)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x4388c): short unsigned int
 <1><5dc>: Abbrev Number: 6 (DW_TAG_base_type)
    <5dd>   DW_AT_byte_size   : 4
    <5de>   DW_AT_encoding    : 5	(signed)
    <5df>   DW_AT_name        : (indirect string, offset: 0x1ad5b): long int
 <1><5e3>: Abbrev Number: 5 (DW_TAG_typedef)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x3b1e7): __uint32_t
    <5e8>   DW_AT_decl_file   : 2
    <5e9>   DW_AT_decl_line   : 79
    <5ea>   DW_AT_decl_column : 25
    <5eb>   DW_AT_type        : <0x5ef>
 <1><5ef>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f0>   DW_AT_byte_size   : 4
    <5f1>   DW_AT_encoding    : 7	(unsigned)
    <5f2>   DW_AT_name        : (indirect string, offset: 0x4f28a): long unsigned int
 <1><5f6>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f7>   DW_AT_byte_size   : 8
    <5f8>   DW_AT_encoding    : 7	(unsigned)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x2e16a): long long unsigned int
 <1><5fd>: Abbrev Number: 5 (DW_TAG_typedef)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x813c): uint8_t
    <602>   DW_AT_decl_file   : 3
    <603>   DW_AT_decl_line   : 24
    <604>   DW_AT_decl_column : 19
    <605>   DW_AT_type        : <0x5af>
 <1><609>: Abbrev Number: 5 (DW_TAG_typedef)
    <60a>   DW_AT_name        : (indirect string, offset: 0x8a805): uint16_t
    <60e>   DW_AT_decl_file   : 3
    <60f>   DW_AT_decl_line   : 36
    <610>   DW_AT_decl_column : 20
    <611>   DW_AT_type        : <0x5c9>
 <1><615>: Abbrev Number: 5 (DW_TAG_typedef)
    <616>   DW_AT_name        : (indirect string, offset: 0x8a7e5): uint32_t
    <61a>   DW_AT_decl_file   : 3
    <61b>   DW_AT_decl_line   : 48
    <61c>   DW_AT_decl_column : 20
    <61d>   DW_AT_type        : <0x5e3>
 <1><621>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <622>   DW_AT_byte_size   : 4
 <1><623>: Abbrev Number: 5 (DW_TAG_typedef)
    <624>   DW_AT_name        : (indirect string, offset: 0x8a855): StackType_t
    <628>   DW_AT_decl_file   : 4
    <629>   DW_AT_decl_line   : 55
    <62a>   DW_AT_decl_column : 24
    <62b>   DW_AT_type        : <0x615>
 <1><62f>: Abbrev Number: 5 (DW_TAG_typedef)
    <630>   DW_AT_name        : (indirect string, offset: 0x8bed9): UBaseType_t
    <634>   DW_AT_decl_file   : 4
    <635>   DW_AT_decl_line   : 57
    <636>   DW_AT_decl_column : 23
    <637>   DW_AT_type        : <0x5ef>
 <1><63b>: Abbrev Number: 5 (DW_TAG_typedef)
    <63c>   DW_AT_name        : (indirect string, offset: 0x89640): TickType_t
    <640>   DW_AT_decl_file   : 4
    <641>   DW_AT_decl_line   : 63
    <642>   DW_AT_decl_column : 19
    <643>   DW_AT_type        : <0x615>
 <1><647>: Abbrev Number: 11 (DW_TAG_typedef)
    <648>   DW_AT_name        : (indirect string, offset: 0x8a8c7): wint_t
    <64c>   DW_AT_decl_file   : 5
    <64d>   DW_AT_decl_line   : 359
    <64f>   DW_AT_decl_column : 23
    <650>   DW_AT_type        : <0x593>
 <1><654>: Abbrev Number: 5 (DW_TAG_typedef)
    <655>   DW_AT_name        : (indirect string, offset: 0x92df4): _off_t
    <659>   DW_AT_decl_file   : 6
    <65a>   DW_AT_decl_line   : 46
    <65b>   DW_AT_decl_column : 14
    <65c>   DW_AT_type        : <0x5dc>
 <1><660>: Abbrev Number: 5 (DW_TAG_typedef)
    <661>   DW_AT_name        : (indirect string, offset: 0x87c37): _fpos_t
    <665>   DW_AT_decl_file   : 6
    <666>   DW_AT_decl_line   : 116
    <667>   DW_AT_decl_column : 14
    <668>   DW_AT_type        : <0x5dc>
 <1><66c>: Abbrev Number: 22 (DW_TAG_union_type)
    <66d>   DW_AT_byte_size   : 4
    <66e>   DW_AT_decl_file   : 6
    <66f>   DW_AT_decl_line   : 165
    <670>   DW_AT_decl_column : 3
    <671>   DW_AT_sibling     : <0x68c>
 <2><675>: Abbrev Number: 15 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x8ac7a): __wch
    <67a>   DW_AT_decl_file   : 6
    <67a>   DW_AT_decl_line   : 167
    <67b>   DW_AT_decl_column : 12
    <67c>   DW_AT_type        : <0x647>
 <2><680>: Abbrev Number: 15 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x8938f): __wchb
    <685>   DW_AT_decl_file   : 6
    <685>   DW_AT_decl_line   : 168
    <686>   DW_AT_decl_column : 19
    <687>   DW_AT_type        : <0x68c>
 <2><68b>: Abbrev Number: 0
 <1><68c>: Abbrev Number: 7 (DW_TAG_array_type)
    <68d>   DW_AT_type        : <0x5bb>
    <691>   DW_AT_sibling     : <0x69c>
 <2><695>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <696>   DW_AT_type        : <0x593>
    <69a>   DW_AT_upper_bound : 3
 <2><69b>: Abbrev Number: 0
 <1><69c>: Abbrev Number: 23 (DW_TAG_structure_type)
    <69d>   DW_AT_byte_size   : 8
    <69e>   DW_AT_decl_file   : 6
    <69f>   DW_AT_decl_line   : 162
    <6a0>   DW_AT_decl_column : 9
    <6a1>   DW_AT_sibling     : <0x6c0>
 <2><6a5>: Abbrev Number: 2 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x88035): __count
    <6aa>   DW_AT_decl_file   : 6
    <6ab>   DW_AT_decl_line   : 164
    <6ac>   DW_AT_decl_column : 7
    <6ad>   DW_AT_type        : <0x58c>
    <6b1>   DW_AT_data_member_location: 0
 <2><6b2>: Abbrev Number: 2 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x8978b): __value
    <6b7>   DW_AT_decl_file   : 6
    <6b8>   DW_AT_decl_line   : 169
    <6b9>   DW_AT_decl_column : 5
    <6ba>   DW_AT_type        : <0x66c>
    <6be>   DW_AT_data_member_location: 4
 <2><6bf>: Abbrev Number: 0
 <1><6c0>: Abbrev Number: 5 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x8943b): _mbstate_t
    <6c5>   DW_AT_decl_file   : 6
    <6c6>   DW_AT_decl_line   : 170
    <6c7>   DW_AT_decl_column : 3
    <6c8>   DW_AT_type        : <0x69c>
 <1><6cc>: Abbrev Number: 5 (DW_TAG_typedef)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x89553): __ULong
    <6d1>   DW_AT_decl_file   : 7
    <6d2>   DW_AT_decl_line   : 22
    <6d3>   DW_AT_decl_column : 25
    <6d4>   DW_AT_type        : <0x5ef>
 <1><6d8>: Abbrev Number: 5 (DW_TAG_typedef)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x8962b): _LOCK_T
    <6dd>   DW_AT_decl_file   : 8
    <6de>   DW_AT_decl_line   : 34
    <6df>   DW_AT_decl_column : 25
    <6e0>   DW_AT_type        : <0x6e4>
 <1><6e4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <6e5>   DW_AT_byte_size   : 4
    <6e5>   DW_AT_type        : <0x6e9>
 <1><6e9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x882d2): __lock
    <6ee>   DW_AT_declaration : 1
 <1><6ee>: Abbrev Number: 5 (DW_TAG_typedef)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x891ec): _flock_t
    <6f3>   DW_AT_decl_file   : 7
    <6f4>   DW_AT_decl_line   : 35
    <6f5>   DW_AT_decl_column : 27
    <6f6>   DW_AT_type        : <0x6d8>
 <1><6fa>: Abbrev Number: 12 (DW_TAG_structure_type)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x884ff): _Bigint
    <6ff>   DW_AT_byte_size   : 24
    <700>   DW_AT_decl_file   : 7
    <700>   DW_AT_decl_line   : 52
    <701>   DW_AT_decl_column : 8
    <701>   DW_AT_sibling     : <0x750>
 <2><705>: Abbrev Number: 2 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0x89954): _next
    <70a>   DW_AT_decl_file   : 7
    <70b>   DW_AT_decl_line   : 54
    <70c>   DW_AT_decl_column : 19
    <70d>   DW_AT_type        : <0x750>
    <711>   DW_AT_data_member_location: 0
 <2><712>: Abbrev Number: 9 (DW_TAG_member)
    <713>   DW_AT_name        : _k
    <716>   DW_AT_decl_file   : 7
    <716>   DW_AT_decl_line   : 55
    <717>   DW_AT_decl_column : 7
    <718>   DW_AT_type        : <0x58c>
    <71c>   DW_AT_data_member_location: 4
 <2><71d>: Abbrev Number: 2 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0x8a728): _maxwds
    <722>   DW_AT_decl_file   : 7
    <723>   DW_AT_decl_line   : 55
    <724>   DW_AT_decl_column : 11
    <725>   DW_AT_type        : <0x58c>
    <729>   DW_AT_data_member_location: 8
 <2><72a>: Abbrev Number: 2 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x894e9): _sign
    <72f>   DW_AT_decl_file   : 7
    <730>   DW_AT_decl_line   : 55
    <731>   DW_AT_decl_column : 20
    <732>   DW_AT_type        : <0x58c>
    <736>   DW_AT_data_member_location: 12
 <2><737>: Abbrev Number: 2 (DW_TAG_member)
    <738>   DW_AT_name        : (indirect string, offset: 0x894e4): _wds
    <73c>   DW_AT_decl_file   : 7
    <73d>   DW_AT_decl_line   : 55
    <73e>   DW_AT_decl_column : 27
    <73f>   DW_AT_type        : <0x58c>
    <743>   DW_AT_data_member_location: 16
 <2><744>: Abbrev Number: 9 (DW_TAG_member)
    <745>   DW_AT_name        : _x
    <748>   DW_AT_decl_file   : 7
    <748>   DW_AT_decl_line   : 56
    <749>   DW_AT_decl_column : 11
    <74a>   DW_AT_type        : <0x755>
    <74e>   DW_AT_data_member_location: 20
 <2><74f>: Abbrev Number: 0
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x6fa>
 <1><755>: Abbrev Number: 7 (DW_TAG_array_type)
    <756>   DW_AT_type        : <0x6cc>
    <75a>   DW_AT_sibling     : <0x765>
 <2><75e>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <75f>   DW_AT_type        : <0x593>
    <763>   DW_AT_upper_bound : 0
 <2><764>: Abbrev Number: 0
 <1><765>: Abbrev Number: 12 (DW_TAG_structure_type)
    <766>   DW_AT_name        : (indirect string, offset: 0x87fa9): __tm
    <76a>   DW_AT_byte_size   : 36
    <76b>   DW_AT_decl_file   : 7
    <76b>   DW_AT_decl_line   : 60
    <76c>   DW_AT_decl_column : 8
    <76c>   DW_AT_sibling     : <0x7e6>
 <2><770>: Abbrev Number: 2 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0x8b046): __tm_sec
    <775>   DW_AT_decl_file   : 7
    <776>   DW_AT_decl_line   : 62
    <777>   DW_AT_decl_column : 9
    <778>   DW_AT_type        : <0x58c>
    <77c>   DW_AT_data_member_location: 0
 <2><77d>: Abbrev Number: 2 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x8677f): __tm_min
    <782>   DW_AT_decl_file   : 7
    <783>   DW_AT_decl_line   : 63
    <784>   DW_AT_decl_column : 9
    <785>   DW_AT_type        : <0x58c>
    <789>   DW_AT_data_member_location: 4
 <2><78a>: Abbrev Number: 2 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x87b17): __tm_hour
    <78f>   DW_AT_decl_file   : 7
    <790>   DW_AT_decl_line   : 64
    <791>   DW_AT_decl_column : 9
    <792>   DW_AT_type        : <0x58c>
    <796>   DW_AT_data_member_location: 8
 <2><797>: Abbrev Number: 2 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x89918): __tm_mday
    <79c>   DW_AT_decl_file   : 7
    <79d>   DW_AT_decl_line   : 65
    <79e>   DW_AT_decl_column : 9
    <79f>   DW_AT_type        : <0x58c>
    <7a3>   DW_AT_data_member_location: 12
 <2><7a4>: Abbrev Number: 2 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x8682a): __tm_mon
    <7a9>   DW_AT_decl_file   : 7
    <7aa>   DW_AT_decl_line   : 66
    <7ab>   DW_AT_decl_column : 9
    <7ac>   DW_AT_type        : <0x58c>
    <7b0>   DW_AT_data_member_location: 16
 <2><7b1>: Abbrev Number: 2 (DW_TAG_member)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x8bf99): __tm_year
    <7b6>   DW_AT_decl_file   : 7
    <7b7>   DW_AT_decl_line   : 67
    <7b8>   DW_AT_decl_column : 9
    <7b9>   DW_AT_type        : <0x58c>
    <7bd>   DW_AT_data_member_location: 20
 <2><7be>: Abbrev Number: 2 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0x88a84): __tm_wday
    <7c3>   DW_AT_decl_file   : 7
    <7c4>   DW_AT_decl_line   : 68
    <7c5>   DW_AT_decl_column : 9
    <7c6>   DW_AT_type        : <0x58c>
    <7ca>   DW_AT_data_member_location: 24
 <2><7cb>: Abbrev Number: 2 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x8ae04): __tm_yday
    <7d0>   DW_AT_decl_file   : 7
    <7d1>   DW_AT_decl_line   : 69
    <7d2>   DW_AT_decl_column : 9
    <7d3>   DW_AT_type        : <0x58c>
    <7d7>   DW_AT_data_member_location: 28
 <2><7d8>: Abbrev Number: 2 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x8b86c): __tm_isdst
    <7dd>   DW_AT_decl_file   : 7
    <7de>   DW_AT_decl_line   : 70
    <7df>   DW_AT_decl_column : 9
    <7e0>   DW_AT_type        : <0x58c>
    <7e4>   DW_AT_data_member_location: 32
 <2><7e5>: Abbrev Number: 0
 <1><7e6>: Abbrev Number: 12 (DW_TAG_structure_type)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x89fbe): __sbuf
    <7eb>   DW_AT_byte_size   : 8
    <7ec>   DW_AT_decl_file   : 7
    <7ec>   DW_AT_decl_line   : 115
    <7ed>   DW_AT_decl_column : 8
    <7ed>   DW_AT_sibling     : <0x80c>
 <2><7f1>: Abbrev Number: 2 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x93ae1): _base
    <7f6>   DW_AT_decl_file   : 7
    <7f7>   DW_AT_decl_line   : 116
    <7f8>   DW_AT_decl_column : 17
    <7f9>   DW_AT_type        : <0x80c>
    <7fd>   DW_AT_data_member_location: 0
 <2><7fe>: Abbrev Number: 2 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x9367a): _size
    <803>   DW_AT_decl_file   : 7
    <804>   DW_AT_decl_line   : 117
    <805>   DW_AT_decl_column : 6
    <806>   DW_AT_type        : <0x58c>
    <80a>   DW_AT_data_member_location: 4
 <2><80b>: Abbrev Number: 0
 <1><80c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <80d>   DW_AT_byte_size   : 4
    <80d>   DW_AT_type        : <0x5bb>
 <1><811>: Abbrev Number: 12 (DW_TAG_structure_type)
    <812>   DW_AT_name        : (indirect string, offset: 0x8abf2): __sFILE
    <816>   DW_AT_byte_size   : 104
    <817>   DW_AT_decl_file   : 7
    <817>   DW_AT_decl_line   : 152
    <818>   DW_AT_decl_column : 8
    <818>   DW_AT_sibling     : <0x94a>
 <2><81c>: Abbrev Number: 9 (DW_TAG_member)
    <81d>   DW_AT_name        : _p
    <820>   DW_AT_decl_file   : 7
    <820>   DW_AT_decl_line   : 153
    <821>   DW_AT_decl_column : 18
    <822>   DW_AT_type        : <0x80c>
    <826>   DW_AT_data_member_location: 0
 <2><827>: Abbrev Number: 9 (DW_TAG_member)
    <828>   DW_AT_name        : _r
    <82b>   DW_AT_decl_file   : 7
    <82b>   DW_AT_decl_line   : 154
    <82c>   DW_AT_decl_column : 7
    <82d>   DW_AT_type        : <0x58c>
    <831>   DW_AT_data_member_location: 4
 <2><832>: Abbrev Number: 9 (DW_TAG_member)
    <833>   DW_AT_name        : _w
    <836>   DW_AT_decl_file   : 7
    <836>   DW_AT_decl_line   : 155
    <837>   DW_AT_decl_column : 7
    <838>   DW_AT_type        : <0x58c>
    <83c>   DW_AT_data_member_location: 8
 <2><83d>: Abbrev Number: 2 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x88e72): _flags
    <842>   DW_AT_decl_file   : 7
    <843>   DW_AT_decl_line   : 156
    <844>   DW_AT_decl_column : 9
    <845>   DW_AT_type        : <0x5c2>
    <849>   DW_AT_data_member_location: 12
 <2><84a>: Abbrev Number: 2 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x8762d): _file
    <84f>   DW_AT_decl_file   : 7
    <850>   DW_AT_decl_line   : 157
    <851>   DW_AT_decl_column : 9
    <852>   DW_AT_type        : <0x5c2>
    <856>   DW_AT_data_member_location: 14
 <2><857>: Abbrev Number: 9 (DW_TAG_member)
    <858>   DW_AT_name        : _bf
    <85c>   DW_AT_decl_file   : 7
    <85c>   DW_AT_decl_line   : 158
    <85d>   DW_AT_decl_column : 17
    <85e>   DW_AT_type        : <0x7e6>
    <862>   DW_AT_data_member_location: 16
 <2><863>: Abbrev Number: 2 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x88ea3): _lbfsize
    <868>   DW_AT_decl_file   : 7
    <869>   DW_AT_decl_line   : 159
    <86a>   DW_AT_decl_column : 7
    <86b>   DW_AT_type        : <0x58c>
    <86f>   DW_AT_data_member_location: 24
 <2><870>: Abbrev Number: 2 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x965d5): _data
    <875>   DW_AT_decl_file   : 7
    <876>   DW_AT_decl_line   : 162
    <877>   DW_AT_decl_column : 18
    <878>   DW_AT_type        : <0xa63>
    <87c>   DW_AT_data_member_location: 28
 <2><87d>: Abbrev Number: 2 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x8b81f): _cookie
    <882>   DW_AT_decl_file   : 7
    <883>   DW_AT_decl_line   : 166
    <884>   DW_AT_decl_column : 10
    <885>   DW_AT_type        : <0x621>
    <889>   DW_AT_data_member_location: 32
 <2><88a>: Abbrev Number: 2 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x8ada8): _read
    <88f>   DW_AT_decl_file   : 7
    <890>   DW_AT_decl_line   : 168
    <891>   DW_AT_decl_column : 29
    <892>   DW_AT_type        : <0xa97>
    <896>   DW_AT_data_member_location: 36
 <2><897>: Abbrev Number: 2 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x873a4): _write
    <89c>   DW_AT_decl_file   : 7
    <89d>   DW_AT_decl_line   : 170
    <89e>   DW_AT_decl_column : 29
    <89f>   DW_AT_type        : <0xabf>
    <8a3>   DW_AT_data_member_location: 40
 <2><8a4>: Abbrev Number: 2 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x8c3e5): _seek
    <8a9>   DW_AT_decl_file   : 7
    <8aa>   DW_AT_decl_line   : 173
    <8ab>   DW_AT_decl_column : 13
    <8ac>   DW_AT_type        : <0xae2>
    <8b0>   DW_AT_data_member_location: 44
 <2><8b1>: Abbrev Number: 2 (DW_TAG_member)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x88d8c): _close
    <8b6>   DW_AT_decl_file   : 7
    <8b7>   DW_AT_decl_line   : 174
    <8b8>   DW_AT_decl_column : 9
    <8b9>   DW_AT_type        : <0xafb>
    <8bd>   DW_AT_data_member_location: 48
 <2><8be>: Abbrev Number: 9 (DW_TAG_member)
    <8bf>   DW_AT_name        : _ub
    <8c3>   DW_AT_decl_file   : 7
    <8c3>   DW_AT_decl_line   : 177
    <8c4>   DW_AT_decl_column : 17
    <8c5>   DW_AT_type        : <0x7e6>
    <8c9>   DW_AT_data_member_location: 52
 <2><8ca>: Abbrev Number: 9 (DW_TAG_member)
    <8cb>   DW_AT_name        : _up
    <8cf>   DW_AT_decl_file   : 7
    <8cf>   DW_AT_decl_line   : 178
    <8d0>   DW_AT_decl_column : 18
    <8d1>   DW_AT_type        : <0x80c>
    <8d5>   DW_AT_data_member_location: 60
 <2><8d6>: Abbrev Number: 9 (DW_TAG_member)
    <8d7>   DW_AT_name        : _ur
    <8db>   DW_AT_decl_file   : 7
    <8db>   DW_AT_decl_line   : 179
    <8dc>   DW_AT_decl_column : 7
    <8dd>   DW_AT_type        : <0x58c>
    <8e1>   DW_AT_data_member_location: 64
 <2><8e2>: Abbrev Number: 2 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x87fa3): _ubuf
    <8e7>   DW_AT_decl_file   : 7
    <8e8>   DW_AT_decl_line   : 182
    <8e9>   DW_AT_decl_column : 17
    <8ea>   DW_AT_type        : <0xb00>
    <8ee>   DW_AT_data_member_location: 68
 <2><8ef>: Abbrev Number: 2 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x8a162): _nbuf
    <8f4>   DW_AT_decl_file   : 7
    <8f5>   DW_AT_decl_line   : 183
    <8f6>   DW_AT_decl_column : 17
    <8f7>   DW_AT_type        : <0xb10>
    <8fb>   DW_AT_data_member_location: 71
 <2><8fc>: Abbrev Number: 9 (DW_TAG_member)
    <8fd>   DW_AT_name        : _lb
    <901>   DW_AT_decl_file   : 7
    <901>   DW_AT_decl_line   : 186
    <902>   DW_AT_decl_column : 17
    <903>   DW_AT_type        : <0x7e6>
    <907>   DW_AT_data_member_location: 72
 <2><908>: Abbrev Number: 2 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0x931bc): _blksize
    <90d>   DW_AT_decl_file   : 7
    <90e>   DW_AT_decl_line   : 189
    <90f>   DW_AT_decl_column : 7
    <910>   DW_AT_type        : <0x58c>
    <914>   DW_AT_data_member_location: 80
 <2><915>: Abbrev Number: 2 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0x88327): _offset
    <91a>   DW_AT_decl_file   : 7
    <91b>   DW_AT_decl_line   : 190
    <91c>   DW_AT_decl_column : 10
    <91d>   DW_AT_type        : <0x654>
    <921>   DW_AT_data_member_location: 84
 <2><922>: Abbrev Number: 2 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x882d3): _lock
    <927>   DW_AT_decl_file   : 7
    <928>   DW_AT_decl_line   : 197
    <929>   DW_AT_decl_column : 12
    <92a>   DW_AT_type        : <0x6ee>
    <92e>   DW_AT_data_member_location: 88
 <2><92f>: Abbrev Number: 2 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0x8727b): _mbstate
    <934>   DW_AT_decl_file   : 7
    <935>   DW_AT_decl_line   : 199
    <936>   DW_AT_decl_column : 14
    <937>   DW_AT_type        : <0x6c0>
    <93b>   DW_AT_data_member_location: 92
 <2><93c>: Abbrev Number: 2 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0x8affc): _flags2
    <941>   DW_AT_decl_file   : 7
    <942>   DW_AT_decl_line   : 200
    <943>   DW_AT_decl_column : 9
    <944>   DW_AT_type        : <0x58c>
    <948>   DW_AT_data_member_location: 100
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <94b>   DW_AT_name        : (indirect string, offset: 0x987e1): _reent
    <94f>   DW_AT_byte_size   : 76
    <950>   DW_AT_decl_file   : 7
    <951>   DW_AT_decl_line   : 375
    <953>   DW_AT_decl_column : 8
    <954>   DW_AT_sibling     : <0xa63>
 <2><958>: Abbrev Number: 1 (DW_TAG_member)
    <959>   DW_AT_name        : (indirect string, offset: 0x9279b): _errno
    <95d>   DW_AT_decl_file   : 7
    <95e>   DW_AT_decl_line   : 379
    <960>   DW_AT_decl_column : 7
    <961>   DW_AT_type        : <0x58c>
    <965>   DW_AT_data_member_location: 0
 <2><966>: Abbrev Number: 1 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x892b7): _stdin
    <96b>   DW_AT_decl_file   : 7
    <96c>   DW_AT_decl_line   : 384
    <96e>   DW_AT_decl_column : 11
    <96f>   DW_AT_type        : <0xb2d>
    <973>   DW_AT_data_member_location: 4
 <2><974>: Abbrev Number: 1 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x8a2c0): _stdout
    <979>   DW_AT_decl_file   : 7
    <97a>   DW_AT_decl_line   : 384
    <97c>   DW_AT_decl_column : 20
    <97d>   DW_AT_type        : <0xb2d>
    <981>   DW_AT_data_member_location: 8
 <2><982>: Abbrev Number: 1 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0x8bca5): _stderr
    <987>   DW_AT_decl_file   : 7
    <988>   DW_AT_decl_line   : 384
    <98a>   DW_AT_decl_column : 30
    <98b>   DW_AT_type        : <0xb2d>
    <98f>   DW_AT_data_member_location: 12
 <2><990>: Abbrev Number: 1 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x89ce1): _inc
    <995>   DW_AT_decl_file   : 7
    <996>   DW_AT_decl_line   : 386
    <998>   DW_AT_decl_column : 8
    <999>   DW_AT_type        : <0x58c>
    <99d>   DW_AT_data_member_location: 16
 <2><99e>: Abbrev Number: 1 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0x8add7): _emergency
    <9a3>   DW_AT_decl_file   : 7
    <9a4>   DW_AT_decl_line   : 388
    <9a6>   DW_AT_decl_column : 9
    <9a7>   DW_AT_type        : <0xa86>
    <9ab>   DW_AT_data_member_location: 20
 <2><9ac>: Abbrev Number: 1 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x8b795): _locale
    <9b1>   DW_AT_decl_file   : 7
    <9b2>   DW_AT_decl_line   : 394
    <9b4>   DW_AT_decl_column : 22
    <9b5>   DW_AT_type        : <0xc93>
    <9b9>   DW_AT_data_member_location: 24
 <2><9ba>: Abbrev Number: 24 (DW_TAG_member)
    <9bb>   DW_AT_name        : _mp
    <9bf>   DW_AT_decl_file   : 7
    <9c0>   DW_AT_decl_line   : 396
    <9c2>   DW_AT_decl_column : 18
    <9c3>   DW_AT_type        : <0xc98>
    <9c7>   DW_AT_data_member_location: 28
 <2><9c8>: Abbrev Number: 1 (DW_TAG_member)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x87633): __cleanup
    <9cd>   DW_AT_decl_file   : 7
    <9ce>   DW_AT_decl_line   : 398
    <9d0>   DW_AT_decl_column : 10
    <9d1>   DW_AT_type        : <0xca8>
    <9d5>   DW_AT_data_member_location: 32
 <2><9d6>: Abbrev Number: 1 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x86dbc): _gamma_signgam
    <9db>   DW_AT_decl_file   : 7
    <9dc>   DW_AT_decl_line   : 400
    <9de>   DW_AT_decl_column : 7
    <9df>   DW_AT_type        : <0x58c>
    <9e3>   DW_AT_data_member_location: 36
 <2><9e4>: Abbrev Number: 1 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x8a8b8): _cvtlen
    <9e9>   DW_AT_decl_file   : 7
    <9ea>   DW_AT_decl_line   : 403
    <9ec>   DW_AT_decl_column : 7
    <9ed>   DW_AT_type        : <0x58c>
    <9f1>   DW_AT_data_member_location: 40
 <2><9f2>: Abbrev Number: 1 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x88eba): _cvtbuf
    <9f7>   DW_AT_decl_file   : 7
    <9f8>   DW_AT_decl_line   : 404
    <9fa>   DW_AT_decl_column : 9
    <9fb>   DW_AT_type        : <0xa86>
    <9ff>   DW_AT_data_member_location: 44
 <2><a00>: Abbrev Number: 1 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x8a9b9): _r48
    <a05>   DW_AT_decl_file   : 7
    <a06>   DW_AT_decl_line   : 406
    <a08>   DW_AT_decl_column : 19
    <a09>   DW_AT_type        : <0xcad>
    <a0d>   DW_AT_data_member_location: 48
 <2><a0e>: Abbrev Number: 1 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x8b118): _localtime_buf
    <a13>   DW_AT_decl_file   : 7
    <a14>   DW_AT_decl_line   : 407
    <a16>   DW_AT_decl_column : 16
    <a17>   DW_AT_type        : <0xcb2>
    <a1b>   DW_AT_data_member_location: 52
 <2><a1c>: Abbrev Number: 1 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x87dc2): _asctime_buf
    <a21>   DW_AT_decl_file   : 7
    <a22>   DW_AT_decl_line   : 408
    <a24>   DW_AT_decl_column : 9
    <a25>   DW_AT_type        : <0xa86>
    <a29>   DW_AT_data_member_location: 56
 <2><a2a>: Abbrev Number: 1 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x86beb): _sig_func
    <a2f>   DW_AT_decl_file   : 7
    <a30>   DW_AT_decl_line   : 411
    <a32>   DW_AT_decl_column : 12
    <a33>   DW_AT_type        : <0xcc2>
    <a37>   DW_AT_data_member_location: 60
 <2><a38>: Abbrev Number: 1 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0x87f9e): __sf
    <a3d>   DW_AT_decl_file   : 7
    <a3e>   DW_AT_decl_line   : 419
    <a40>   DW_AT_decl_column : 11
    <a41>   DW_AT_type        : <0xb2d>
    <a45>   DW_AT_data_member_location: 64
 <2><a46>: Abbrev Number: 1 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x88e01): _misc
    <a4b>   DW_AT_decl_file   : 7
    <a4c>   DW_AT_decl_line   : 420
    <a4e>   DW_AT_decl_column : 23
    <a4f>   DW_AT_type        : <0xccc>
    <a53>   DW_AT_data_member_location: 68
 <2><a54>: Abbrev Number: 1 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x89bcb): _signal_buf
    <a59>   DW_AT_decl_file   : 7
    <a5a>   DW_AT_decl_line   : 421
    <a5c>   DW_AT_decl_column : 9
    <a5d>   DW_AT_type        : <0xa86>
    <a61>   DW_AT_data_member_location: 72
 <2><a62>: Abbrev Number: 0
 <1><a63>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a64>   DW_AT_byte_size   : 4
    <a64>   DW_AT_type        : <0x94a>
 <1><a68>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <a69>   DW_AT_prototyped  : 1
    <a69>   DW_AT_type        : <0x58c>
    <a6d>   DW_AT_sibling     : <0xa86>
 <2><a71>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a72>   DW_AT_type        : <0xa63>
 <2><a76>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a77>   DW_AT_type        : <0x621>
 <2><a7b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a7c>   DW_AT_type        : <0xa86>
 <2><a80>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a81>   DW_AT_type        : <0x58c>
 <2><a85>: Abbrev Number: 0
 <1><a86>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a87>   DW_AT_byte_size   : 4
    <a87>   DW_AT_type        : <0xa8b>
 <1><a8b>: Abbrev Number: 6 (DW_TAG_base_type)
    <a8c>   DW_AT_byte_size   : 1
    <a8d>   DW_AT_encoding    : 8	(unsigned char)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x88399): char
 <1><a92>: Abbrev Number: 25 (DW_TAG_const_type)
    <a93>   DW_AT_type        : <0xa8b>
 <1><a97>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a98>   DW_AT_byte_size   : 4
    <a98>   DW_AT_type        : <0xa68>
 <1><a9c>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <a9d>   DW_AT_prototyped  : 1
    <a9d>   DW_AT_type        : <0x58c>
    <aa1>   DW_AT_sibling     : <0xaba>
 <2><aa5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <aa6>   DW_AT_type        : <0xa63>
 <2><aaa>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <aab>   DW_AT_type        : <0x621>
 <2><aaf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ab0>   DW_AT_type        : <0xaba>
 <2><ab4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ab5>   DW_AT_type        : <0x58c>
 <2><ab9>: Abbrev Number: 0
 <1><aba>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <abb>   DW_AT_byte_size   : 4
    <abb>   DW_AT_type        : <0xa92>
 <1><abf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ac0>   DW_AT_byte_size   : 4
    <ac0>   DW_AT_type        : <0xa9c>
 <1><ac4>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <ac5>   DW_AT_prototyped  : 1
    <ac5>   DW_AT_type        : <0x660>
    <ac9>   DW_AT_sibling     : <0xae2>
 <2><acd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ace>   DW_AT_type        : <0xa63>
 <2><ad2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ad3>   DW_AT_type        : <0x621>
 <2><ad7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ad8>   DW_AT_type        : <0x660>
 <2><adc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <add>   DW_AT_type        : <0x58c>
 <2><ae1>: Abbrev Number: 0
 <1><ae2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ae3>   DW_AT_byte_size   : 4
    <ae3>   DW_AT_type        : <0xac4>
 <1><ae7>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <ae8>   DW_AT_prototyped  : 1
    <ae8>   DW_AT_type        : <0x58c>
    <aec>   DW_AT_sibling     : <0xafb>
 <2><af0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <af1>   DW_AT_type        : <0xa63>
 <2><af5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <af6>   DW_AT_type        : <0x621>
 <2><afa>: Abbrev Number: 0
 <1><afb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <afc>   DW_AT_byte_size   : 4
    <afc>   DW_AT_type        : <0xae7>
 <1><b00>: Abbrev Number: 7 (DW_TAG_array_type)
    <b01>   DW_AT_type        : <0x5bb>
    <b05>   DW_AT_sibling     : <0xb10>
 <2><b09>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b0a>   DW_AT_type        : <0x593>
    <b0e>   DW_AT_upper_bound : 2
 <2><b0f>: Abbrev Number: 0
 <1><b10>: Abbrev Number: 7 (DW_TAG_array_type)
    <b11>   DW_AT_type        : <0x5bb>
    <b15>   DW_AT_sibling     : <0xb20>
 <2><b19>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b1a>   DW_AT_type        : <0x593>
    <b1e>   DW_AT_upper_bound : 0
 <2><b1f>: Abbrev Number: 0
 <1><b20>: Abbrev Number: 11 (DW_TAG_typedef)
    <b21>   DW_AT_name        : (indirect string, offset: 0x89d1b): __FILE
    <b25>   DW_AT_decl_file   : 7
    <b26>   DW_AT_decl_line   : 269
    <b28>   DW_AT_decl_column : 26
    <b29>   DW_AT_type        : <0x811>
 <1><b2d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b2e>   DW_AT_byte_size   : 4
    <b2e>   DW_AT_type        : <0xb20>
 <1><b32>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b33>   DW_AT_name        : (indirect string, offset: 0x884f7): _rand48
    <b37>   DW_AT_byte_size   : 24
    <b38>   DW_AT_decl_file   : 7
    <b39>   DW_AT_decl_line   : 305
    <b3b>   DW_AT_decl_column : 8
    <b3c>   DW_AT_sibling     : <0xb79>
 <2><b40>: Abbrev Number: 1 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0x88111): _seed
    <b45>   DW_AT_decl_file   : 7
    <b46>   DW_AT_decl_line   : 306
    <b48>   DW_AT_decl_column : 18
    <b49>   DW_AT_type        : <0xb79>
    <b4d>   DW_AT_data_member_location: 0
 <2><b4e>: Abbrev Number: 1 (DW_TAG_member)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x86f3b): _mult
    <b53>   DW_AT_decl_file   : 7
    <b54>   DW_AT_decl_line   : 307
    <b56>   DW_AT_decl_column : 18
    <b57>   DW_AT_type        : <0xb79>
    <b5b>   DW_AT_data_member_location: 6
 <2><b5c>: Abbrev Number: 1 (DW_TAG_member)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x89396): _add
    <b61>   DW_AT_decl_file   : 7
    <b62>   DW_AT_decl_line   : 308
    <b64>   DW_AT_decl_column : 18
    <b65>   DW_AT_type        : <0x5d5>
    <b69>   DW_AT_data_member_location: 12
 <2><b6a>: Abbrev Number: 1 (DW_TAG_member)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x8994f): _rand_next
    <b6f>   DW_AT_decl_file   : 7
    <b70>   DW_AT_decl_line   : 311
    <b72>   DW_AT_decl_column : 36
    <b73>   DW_AT_type        : <0x5f6>
    <b77>   DW_AT_data_member_location: 16
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 7 (DW_TAG_array_type)
    <b7a>   DW_AT_type        : <0x5d5>
    <b7e>   DW_AT_sibling     : <0xb89>
 <2><b82>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b83>   DW_AT_type        : <0x593>
    <b87>   DW_AT_upper_bound : 2
 <2><b88>: Abbrev Number: 0
 <1><b89>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8ab64): _mprec
    <b8e>   DW_AT_byte_size   : 16
    <b8f>   DW_AT_decl_file   : 7
    <b90>   DW_AT_decl_line   : 347
    <b92>   DW_AT_decl_column : 8
    <b93>   DW_AT_sibling     : <0xbd0>
 <2><b97>: Abbrev Number: 1 (DW_TAG_member)
    <b98>   DW_AT_name        : (indirect string, offset: 0x8c5ad): _result
    <b9c>   DW_AT_decl_file   : 7
    <b9d>   DW_AT_decl_line   : 350
    <b9f>   DW_AT_decl_column : 19
    <ba0>   DW_AT_type        : <0x750>
    <ba4>   DW_AT_data_member_location: 0
 <2><ba5>: Abbrev Number: 1 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x8ab15): _result_k
    <baa>   DW_AT_decl_file   : 7
    <bab>   DW_AT_decl_line   : 351
    <bad>   DW_AT_decl_column : 7
    <bae>   DW_AT_type        : <0x58c>
    <bb2>   DW_AT_data_member_location: 4
 <2><bb3>: Abbrev Number: 1 (DW_TAG_member)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x89125): _p5s
    <bb8>   DW_AT_decl_file   : 7
    <bb9>   DW_AT_decl_line   : 352
    <bbb>   DW_AT_decl_column : 19
    <bbc>   DW_AT_type        : <0x750>
    <bc0>   DW_AT_data_member_location: 8
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x897cd): _freelist
    <bc6>   DW_AT_decl_file   : 7
    <bc7>   DW_AT_decl_line   : 353
    <bc9>   DW_AT_decl_column : 20
    <bca>   DW_AT_type        : <0xbd0>
    <bce>   DW_AT_data_member_location: 12
 <2><bcf>: Abbrev Number: 0
 <1><bd0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <bd1>   DW_AT_byte_size   : 4
    <bd1>   DW_AT_type        : <0x750>
 <1><bd5>: Abbrev Number: 10 (DW_TAG_structure_type)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x89119): _misc_reent
    <bda>   DW_AT_byte_size   : 80
    <bdb>   DW_AT_decl_file   : 7
    <bdc>   DW_AT_decl_line   : 357
    <bde>   DW_AT_decl_column : 8
    <bdf>   DW_AT_sibling     : <0xc7e>
 <2><be3>: Abbrev Number: 1 (DW_TAG_member)
    <be4>   DW_AT_name        : (indirect string, offset: 0x8bdef): _strtok_last
    <be8>   DW_AT_decl_file   : 7
    <be9>   DW_AT_decl_line   : 360
    <beb>   DW_AT_decl_column : 9
    <bec>   DW_AT_type        : <0xa86>
    <bf0>   DW_AT_data_member_location: 0
 <2><bf1>: Abbrev Number: 1 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x88d28): _mblen_state
    <bf6>   DW_AT_decl_file   : 7
    <bf7>   DW_AT_decl_line   : 361
    <bf9>   DW_AT_decl_column : 14
    <bfa>   DW_AT_type        : <0x6c0>
    <bfe>   DW_AT_data_member_location: 4
 <2><bff>: Abbrev Number: 1 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0x8bdfc): _wctomb_state
    <c04>   DW_AT_decl_file   : 7
    <c05>   DW_AT_decl_line   : 362
    <c07>   DW_AT_decl_column : 14
    <c08>   DW_AT_type        : <0x6c0>
    <c0c>   DW_AT_data_member_location: 12
 <2><c0d>: Abbrev Number: 1 (DW_TAG_member)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x8b4a6): _mbtowc_state
    <c12>   DW_AT_decl_file   : 7
    <c13>   DW_AT_decl_line   : 363
    <c15>   DW_AT_decl_column : 14
    <c16>   DW_AT_type        : <0x6c0>
    <c1a>   DW_AT_data_member_location: 20
 <2><c1b>: Abbrev Number: 1 (DW_TAG_member)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x892cc): _l64a_buf
    <c20>   DW_AT_decl_file   : 7
    <c21>   DW_AT_decl_line   : 364
    <c23>   DW_AT_decl_column : 8
    <c24>   DW_AT_type        : <0xc7e>
    <c28>   DW_AT_data_member_location: 28
 <2><c29>: Abbrev Number: 1 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x8bc6a): _getdate_err
    <c2e>   DW_AT_decl_file   : 7
    <c2f>   DW_AT_decl_line   : 365
    <c31>   DW_AT_decl_column : 7
    <c32>   DW_AT_type        : <0x58c>
    <c36>   DW_AT_data_member_location: 36
 <2><c37>: Abbrev Number: 1 (DW_TAG_member)
    <c38>   DW_AT_name        : (indirect string, offset: 0x8912a): _mbrlen_state
    <c3c>   DW_AT_decl_file   : 7
    <c3d>   DW_AT_decl_line   : 366
    <c3f>   DW_AT_decl_column : 14
    <c40>   DW_AT_type        : <0x6c0>
    <c44>   DW_AT_data_member_location: 40
 <2><c45>: Abbrev Number: 1 (DW_TAG_member)
    <c46>   DW_AT_name        : (indirect string, offset: 0x87be9): _mbrtowc_state
    <c4a>   DW_AT_decl_file   : 7
    <c4b>   DW_AT_decl_line   : 367
    <c4d>   DW_AT_decl_column : 14
    <c4e>   DW_AT_type        : <0x6c0>
    <c52>   DW_AT_data_member_location: 48
 <2><c53>: Abbrev Number: 1 (DW_TAG_member)
    <c54>   DW_AT_name        : (indirect string, offset: 0x89f63): _mbsrtowcs_state
    <c58>   DW_AT_decl_file   : 7
    <c59>   DW_AT_decl_line   : 368
    <c5b>   DW_AT_decl_column : 14
    <c5c>   DW_AT_type        : <0x6c0>
    <c60>   DW_AT_data_member_location: 56
 <2><c61>: Abbrev Number: 1 (DW_TAG_member)
    <c62>   DW_AT_name        : (indirect string, offset: 0x882c3): _wcrtomb_state
    <c66>   DW_AT_decl_file   : 7
    <c67>   DW_AT_decl_line   : 369
    <c69>   DW_AT_decl_column : 14
    <c6a>   DW_AT_type        : <0x6c0>
    <c6e>   DW_AT_data_member_location: 64
 <2><c6f>: Abbrev Number: 1 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x896df): _wcsrtombs_state
    <c74>   DW_AT_decl_file   : 7
    <c75>   DW_AT_decl_line   : 370
    <c77>   DW_AT_decl_column : 14
    <c78>   DW_AT_type        : <0x6c0>
    <c7c>   DW_AT_data_member_location: 72
 <2><c7d>: Abbrev Number: 0
 <1><c7e>: Abbrev Number: 7 (DW_TAG_array_type)
    <c7f>   DW_AT_type        : <0xa8b>
    <c83>   DW_AT_sibling     : <0xc8e>
 <2><c87>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c88>   DW_AT_type        : <0x593>
    <c8c>   DW_AT_upper_bound : 7
 <2><c8d>: Abbrev Number: 0
 <1><c8e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x8b4e4): __locale_t
    <c93>   DW_AT_declaration : 1
 <1><c93>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c94>   DW_AT_byte_size   : 4
    <c94>   DW_AT_type        : <0xc8e>
 <1><c98>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c99>   DW_AT_byte_size   : 4
    <c99>   DW_AT_type        : <0xb89>
 <1><c9d>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <c9e>   DW_AT_prototyped  : 1
    <c9e>   DW_AT_sibling     : <0xca8>
 <2><ca2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ca3>   DW_AT_type        : <0xa63>
 <2><ca7>: Abbrev Number: 0
 <1><ca8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca9>   DW_AT_byte_size   : 4
    <ca9>   DW_AT_type        : <0xc9d>
 <1><cad>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cae>   DW_AT_byte_size   : 4
    <cae>   DW_AT_type        : <0xb32>
 <1><cb2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cb3>   DW_AT_byte_size   : 4
    <cb3>   DW_AT_type        : <0x765>
 <1><cb7>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <cb8>   DW_AT_prototyped  : 1
    <cb8>   DW_AT_sibling     : <0xcc2>
 <2><cbc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cbd>   DW_AT_type        : <0x58c>
 <2><cc1>: Abbrev Number: 0
 <1><cc2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cc3>   DW_AT_byte_size   : 4
    <cc3>   DW_AT_type        : <0xcc7>
 <1><cc7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cc8>   DW_AT_byte_size   : 4
    <cc8>   DW_AT_type        : <0xcb7>
 <1><ccc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ccd>   DW_AT_byte_size   : 4
    <ccd>   DW_AT_type        : <0xbd5>
 <1><cd1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x8b25a): xSTATIC_LIST_ITEM
    <cd6>   DW_AT_byte_size   : 20
    <cd7>   DW_AT_decl_file   : 9
    <cd8>   DW_AT_decl_line   : 1061
    <cda>   DW_AT_decl_column : 8
    <cdb>   DW_AT_sibling     : <0xcfc>
 <2><cdf>: Abbrev Number: 1 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x96ac4): xDummy2
    <ce4>   DW_AT_decl_file   : 9
    <ce5>   DW_AT_decl_line   : 1066
    <ce7>   DW_AT_decl_column : 13
    <ce8>   DW_AT_type        : <0x63b>
    <cec>   DW_AT_data_member_location: 0
 <2><ced>: Abbrev Number: 1 (DW_TAG_member)
    <cee>   DW_AT_name        : (indirect string, offset: 0x8868a): pvDummy3
    <cf2>   DW_AT_decl_file   : 9
    <cf3>   DW_AT_decl_line   : 1067
    <cf5>   DW_AT_decl_column : 8
    <cf6>   DW_AT_type        : <0xcfc>
    <cfa>   DW_AT_data_member_location: 4
 <2><cfb>: Abbrev Number: 0
 <1><cfc>: Abbrev Number: 7 (DW_TAG_array_type)
    <cfd>   DW_AT_type        : <0x621>
    <d01>   DW_AT_sibling     : <0xd0c>
 <2><d05>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <d06>   DW_AT_type        : <0x593>
    <d0a>   DW_AT_upper_bound : 3
 <2><d0b>: Abbrev Number: 0
 <1><d0c>: Abbrev Number: 11 (DW_TAG_typedef)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x88693): StaticListItem_t
    <d11>   DW_AT_decl_file   : 9
    <d12>   DW_AT_decl_line   : 1072
    <d14>   DW_AT_decl_column : 34
    <d15>   DW_AT_type        : <0xcd1>
 <1><d19>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x8977f): xSTATIC_TCB
    <d1e>   DW_AT_byte_size   : 172
    <d1f>   DW_AT_decl_file   : 9
    <d20>   DW_AT_decl_line   : 1112
    <d22>   DW_AT_decl_column : 16
    <d23>   DW_AT_sibling     : <0xdd0>
 <2><d27>: Abbrev Number: 1 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0x87a57): pxDummy1
    <d2c>   DW_AT_decl_file   : 9
    <d2d>   DW_AT_decl_line   : 1114
    <d2f>   DW_AT_decl_column : 11
    <d30>   DW_AT_type        : <0x621>
    <d34>   DW_AT_data_member_location: 0
 <2><d35>: Abbrev Number: 1 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0x8796d): xDummy3
    <d3a>   DW_AT_decl_file   : 9
    <d3b>   DW_AT_decl_line   : 1118
    <d3d>   DW_AT_decl_column : 19
    <d3e>   DW_AT_type        : <0xdd0>
    <d42>   DW_AT_data_member_location: 4
 <2><d43>: Abbrev Number: 1 (DW_TAG_member)
    <d44>   DW_AT_name        : (indirect string, offset: 0x874bd): uxDummy5
    <d48>   DW_AT_decl_file   : 9
    <d49>   DW_AT_decl_line   : 1119
    <d4b>   DW_AT_decl_column : 16
    <d4c>   DW_AT_type        : <0x62f>
    <d50>   DW_AT_data_member_location: 44
 <2><d51>: Abbrev Number: 1 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x87a60): pxDummy6
    <d56>   DW_AT_decl_file   : 9
    <d57>   DW_AT_decl_line   : 1120
    <d59>   DW_AT_decl_column : 11
    <d5a>   DW_AT_type        : <0x621>
    <d5e>   DW_AT_data_member_location: 48
 <2><d5f>: Abbrev Number: 1 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x8854f): ucDummy7
    <d64>   DW_AT_decl_file   : 9
    <d65>   DW_AT_decl_line   : 1121
    <d67>   DW_AT_decl_column : 13
    <d68>   DW_AT_type        : <0xde0>
    <d6c>   DW_AT_data_member_location: 52
 <2><d6d>: Abbrev Number: 1 (DW_TAG_member)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x8b8ab): uxDummy10
    <d72>   DW_AT_decl_file   : 9
    <d73>   DW_AT_decl_line   : 1129
    <d75>   DW_AT_decl_column : 16
    <d76>   DW_AT_type        : <0xdf0>
    <d7a>   DW_AT_data_member_location: 68
 <2><d7b>: Abbrev Number: 1 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x8b8b5): uxDummy12
    <d80>   DW_AT_decl_file   : 9
    <d81>   DW_AT_decl_line   : 1132
    <d83>   DW_AT_decl_column : 16
    <d84>   DW_AT_type        : <0xdf0>
    <d88>   DW_AT_data_member_location: 76
 <2><d89>: Abbrev Number: 1 (DW_TAG_member)
    <d8a>   DW_AT_name        : (indirect string, offset: 0x874f0): ulDummy16
    <d8e>   DW_AT_decl_file   : 9
    <d8f>   DW_AT_decl_line   : 1141
    <d91>   DW_AT_decl_column : 13
    <d92>   DW_AT_type        : <0x615>
    <d96>   DW_AT_data_member_location: 84
 <2><d97>: Abbrev Number: 1 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x8ae76): xDummy17
    <d9c>   DW_AT_decl_file   : 9
    <d9d>   DW_AT_decl_line   : 1144
    <d9f>   DW_AT_decl_column : 17
    <da0>   DW_AT_type        : <0x94a>
    <da4>   DW_AT_data_member_location: 88
 <2><da5>: Abbrev Number: 1 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0x874fa): ulDummy18
    <daa>   DW_AT_decl_file   : 9
    <dab>   DW_AT_decl_line   : 1147
    <dad>   DW_AT_decl_column : 14
    <dae>   DW_AT_type        : <0x615>
    <db2>   DW_AT_data_member_location: 164
 <2><db3>: Abbrev Number: 1 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x8c3eb): ucDummy19
    <db8>   DW_AT_decl_file   : 9
    <db9>   DW_AT_decl_line   : 1148
    <dbb>   DW_AT_decl_column : 13
    <dbc>   DW_AT_type        : <0x5fd>
    <dc0>   DW_AT_data_member_location: 168
 <2><dc1>: Abbrev Number: 1 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x8b8d9): uxDummy20
    <dc6>   DW_AT_decl_file   : 9
    <dc7>   DW_AT_decl_line   : 1151
    <dc9>   DW_AT_decl_column : 13
    <dca>   DW_AT_type        : <0x5fd>
    <dce>   DW_AT_data_member_location: 169
 <2><dcf>: Abbrev Number: 0
 <1><dd0>: Abbrev Number: 7 (DW_TAG_array_type)
    <dd1>   DW_AT_type        : <0xd0c>
    <dd5>   DW_AT_sibling     : <0xde0>
 <2><dd9>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <dda>   DW_AT_type        : <0x593>
    <dde>   DW_AT_upper_bound : 1
 <2><ddf>: Abbrev Number: 0
 <1><de0>: Abbrev Number: 7 (DW_TAG_array_type)
    <de1>   DW_AT_type        : <0x5fd>
    <de5>   DW_AT_sibling     : <0xdf0>
 <2><de9>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <dea>   DW_AT_type        : <0x593>
    <dee>   DW_AT_upper_bound : 15
 <2><def>: Abbrev Number: 0
 <1><df0>: Abbrev Number: 7 (DW_TAG_array_type)
    <df1>   DW_AT_type        : <0x62f>
    <df5>   DW_AT_sibling     : <0xe00>
 <2><df9>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <dfa>   DW_AT_type        : <0x593>
    <dfe>   DW_AT_upper_bound : 1
 <2><dff>: Abbrev Number: 0
 <1><e00>: Abbrev Number: 11 (DW_TAG_typedef)
    <e01>   DW_AT_name        : (indirect string, offset: 0x891f5): StaticTask_t
    <e05>   DW_AT_decl_file   : 9
    <e06>   DW_AT_decl_line   : 1160
    <e08>   DW_AT_decl_column : 3
    <e09>   DW_AT_type        : <0xd19>
 <1><e0d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e0e>   DW_AT_byte_size   : 4
    <e0e>   DW_AT_type        : <0x623>
 <1><e12>: Abbrev Number: 18 (DW_TAG_variable)
    <e13>   DW_AT_name        : (indirect string, offset: 0x89495): xIdleTaskTCBBuffer
    <e17>   DW_AT_decl_file   : 1
    <e17>   DW_AT_decl_line   : 76
    <e18>   DW_AT_decl_column : 21
    <e19>   DW_AT_type        : <0xe00>
    <e1d>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><e23>: Abbrev Number: 7 (DW_TAG_array_type)
    <e24>   DW_AT_type        : <0x623>
    <e28>   DW_AT_sibling     : <0xe33>
 <2><e2c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <e2d>   DW_AT_type        : <0x593>
    <e31>   DW_AT_upper_bound : 127
 <2><e32>: Abbrev Number: 0
 <1><e33>: Abbrev Number: 18 (DW_TAG_variable)
    <e34>   DW_AT_name        : (indirect string, offset: 0x88790): xIdleStack
    <e38>   DW_AT_decl_file   : 1
    <e38>   DW_AT_decl_line   : 77
    <e39>   DW_AT_decl_column : 20
    <e3a>   DW_AT_type        : <0xe23>
    <e3e>   DW_AT_location    : 5 byte block: 3 40 1 0 20 	(DW_OP_addr: 20000140)
 <1><e44>: Abbrev Number: 26 (DW_TAG_subprogram)
    <e45>   DW_AT_external    : 1
    <e45>   DW_AT_name        : (indirect string, offset: 0x87178): vApplicationGetIdleTaskMemory
    <e49>   DW_AT_decl_file   : 1
    <e4a>   DW_AT_decl_line   : 79
    <e4b>   DW_AT_decl_column : 6
    <e4c>   DW_AT_prototyped  : 1
    <e4c>   DW_AT_low_pc      : 0x800cc58
    <e50>   DW_AT_high_pc     : 0x34
    <e54>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e56>   DW_AT_call_all_calls: 1
    <e56>   DW_AT_sibling     : <0xe82>
 <2><e5a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x89493): ppxIdleTaskTCBBuffer
    <e5f>   DW_AT_decl_file   : 1
    <e5f>   DW_AT_decl_line   : 79
    <e5f>   DW_AT_decl_column : 52
    <e60>   DW_AT_type        : <0xe82>
    <e64>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e67>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e68>   DW_AT_name        : (indirect string, offset: 0x897d7): ppxIdleTaskStackBuffer
    <e6c>   DW_AT_decl_file   : 1
    <e6c>   DW_AT_decl_line   : 79
    <e6c>   DW_AT_decl_column : 88
    <e6d>   DW_AT_type        : <0xe8c>
    <e71>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e74>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e75>   DW_AT_name        : (indirect string, offset: 0x89aa4): pulIdleTaskStackSize
    <e79>   DW_AT_decl_file   : 1
    <e79>   DW_AT_decl_line   : 79
    <e79>   DW_AT_decl_column : 122
    <e7a>   DW_AT_type        : <0xe91>
    <e7e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e81>: Abbrev Number: 0
 <1><e82>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e83>   DW_AT_byte_size   : 4
    <e83>   DW_AT_type        : <0xe87>
 <1><e87>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e88>   DW_AT_byte_size   : 4
    <e88>   DW_AT_type        : <0xe00>
 <1><e8c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e8d>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0xe0d>
 <1><e91>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e92>   DW_AT_byte_size   : 4
    <e92>   DW_AT_type        : <0x615>
 <1><e96>: Abbrev Number: 27 (DW_TAG_subprogram)
    <e97>   DW_AT_external    : 1
    <e97>   DW_AT_name        : (indirect string, offset: 0x88e26): getRunTimeCounterValue
    <e9b>   DW_AT_decl_file   : 1
    <e9c>   DW_AT_decl_line   : 69
    <e9d>   DW_AT_decl_column : 22
    <e9e>   DW_AT_prototyped  : 1
    <e9e>   DW_AT_type        : <0x5ef>
    <ea2>   DW_AT_low_pc      : 0x800cc46
    <ea6>   DW_AT_high_pc     : 0x10
    <eaa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eac>   DW_AT_call_all_calls: 1
 <1><eac>: Abbrev Number: 28 (DW_TAG_subprogram)
    <ead>   DW_AT_external    : 1
    <ead>   DW_AT_name        : (indirect string, offset: 0x87a90): configureTimerForRunTimeStats
    <eb1>   DW_AT_decl_file   : 1
    <eb2>   DW_AT_decl_line   : 64
    <eb3>   DW_AT_decl_column : 13
    <eb4>   DW_AT_prototyped  : 1
    <eb4>   DW_AT_low_pc      : 0x800cc38
    <eb8>   DW_AT_high_pc     : 0xe
    <ebc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ebe>   DW_AT_call_all_calls: 1
 <1><ebe>: Abbrev Number: 0
  Compilation Unit @ offset 0xebf:
   Length:        0x25b0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x337
   Pointer Size:  4
 <0><ecb>: Abbrev Number: 45 (DW_TAG_compile_unit)
    <ecc>   DW_AT_producer    : (indirect string, offset: 0x85ebb): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ed0>   DW_AT_language    : 29	(C11)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x91b05): ../Core/Src/main.c
    <ed5>   DW_AT_comp_dir    : (indirect string, offset: 0x46d21): C:/Users/brech/STM32CubeIDE/workspace_1.14.0/Aether_Update/Debug
    <ed9>   DW_AT_ranges      : 0x6e
    <edd>   DW_AT_low_pc      : 0
    <ee1>   DW_AT_stmt_list   : 0x151f
    <ee5>   DW_AT_macros      : 0x153df
 <1><ee9>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <eea>   DW_AT_encoding    : 5	(signed)
    <eeb>   DW_AT_byte_size   : 1
    <eec>   DW_AT_type        : <0x1078>
    <ef0>   DW_AT_decl_file   : 3
    <ef1>   DW_AT_decl_line   : 66
    <ef2>   DW_AT_decl_column : 1
    <ef3>   DW_AT_sibling     : <0x1078>
 <2><ef7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x91a97): NonMaskableInt_IRQn
    <efc>   DW_AT_const_value : -14
 <2><efd>: Abbrev Number: 19 (DW_TAG_enumerator)
    <efe>   DW_AT_name        : (indirect string, offset: 0x902e9): MemoryManagement_IRQn
    <f02>   DW_AT_const_value : -12
 <2><f03>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f04>   DW_AT_name        : (indirect string, offset: 0x90f4e): BusFault_IRQn
    <f08>   DW_AT_const_value : -11
 <2><f09>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x91a2d): UsageFault_IRQn
    <f0e>   DW_AT_const_value : -10
 <2><f0f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f10>   DW_AT_name        : (indirect string, offset: 0x8c6eb): SVCall_IRQn
    <f14>   DW_AT_const_value : -5
 <2><f15>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f16>   DW_AT_name        : (indirect string, offset: 0x8f30c): DebugMonitor_IRQn
    <f1a>   DW_AT_const_value : -4
 <2><f1b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x8f879): PendSV_IRQn
    <f20>   DW_AT_const_value : -2
 <2><f21>: Abbrev Number: 19 (DW_TAG_enumerator)
    <f22>   DW_AT_name        : (indirect string, offset: 0x911f6): SysTick_IRQn
    <f26>   DW_AT_const_value : -1
 <2><f27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f28>   DW_AT_name        : (indirect string, offset: 0x9067f): WWDG_IRQn
    <f2c>   DW_AT_const_value : 0
 <2><f2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x8d3ad): PVD_IRQn
    <f32>   DW_AT_const_value : 1
 <2><f33>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f34>   DW_AT_name        : (indirect string, offset: 0x92239): TAMP_STAMP_IRQn
    <f38>   DW_AT_const_value : 2
 <2><f39>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x8fdd4): RTC_WKUP_IRQn
    <f3e>   DW_AT_const_value : 3
 <2><f3f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f40>   DW_AT_name        : (indirect string, offset: 0x8db62): FLASH_IRQn
    <f44>   DW_AT_const_value : 4
 <2><f45>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f46>   DW_AT_name        : (indirect string, offset: 0x90f24): RCC_IRQn
    <f4a>   DW_AT_const_value : 5
 <2><f4b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x8f31e): EXTI0_IRQn
    <f50>   DW_AT_const_value : 6
 <2><f51>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f52>   DW_AT_name        : (indirect string, offset: 0x921b1): EXTI1_IRQn
    <f56>   DW_AT_const_value : 7
 <2><f57>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f58>   DW_AT_name        : (indirect string, offset: 0x8ef76): EXTI2_IRQn
    <f5c>   DW_AT_const_value : 8
 <2><f5d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x9128e): EXTI3_IRQn
    <f62>   DW_AT_const_value : 9
 <2><f63>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f64>   DW_AT_name        : (indirect string, offset: 0x8decc): EXTI4_IRQn
    <f68>   DW_AT_const_value : 10
 <2><f69>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x8d195): DMA1_Stream0_IRQn
    <f6e>   DW_AT_const_value : 11
 <2><f6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0x9235a): DMA1_Stream1_IRQn
    <f74>   DW_AT_const_value : 12
 <2><f75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f76>   DW_AT_name        : (indirect string, offset: 0x8edc4): DMA1_Stream2_IRQn
    <f7a>   DW_AT_const_value : 13
 <2><f7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x8e1c8): DMA1_Stream3_IRQn
    <f80>   DW_AT_const_value : 14
 <2><f81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f82>   DW_AT_name        : (indirect string, offset: 0x8e189): DMA1_Stream4_IRQn
    <f86>   DW_AT_const_value : 15
 <2><f87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f88>   DW_AT_name        : (indirect string, offset: 0x90bea): DMA1_Stream5_IRQn
    <f8c>   DW_AT_const_value : 16
 <2><f8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f8e>   DW_AT_name        : (indirect string, offset: 0x8d7a0): DMA1_Stream6_IRQn
    <f92>   DW_AT_const_value : 17
 <2><f93>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f94>   DW_AT_name        : (indirect string, offset: 0x8f40c): ADC_IRQn
    <f98>   DW_AT_const_value : 18
 <2><f99>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x8cb00): EXTI9_5_IRQn
    <f9e>   DW_AT_const_value : 23
 <2><f9f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x8eabc): TIM1_BRK_TIM9_IRQn
    <fa4>   DW_AT_const_value : 24
 <2><fa5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x8fc4b): TIM1_UP_TIM10_IRQn
    <faa>   DW_AT_const_value : 25
 <2><fab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fac>   DW_AT_name        : (indirect string, offset: 0x908e4): TIM1_TRG_COM_TIM11_IRQn
    <fb0>   DW_AT_const_value : 26
 <2><fb1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x8e3d2): TIM1_CC_IRQn
    <fb6>   DW_AT_const_value : 27
 <2><fb7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x8d10c): TIM2_IRQn
    <fbc>   DW_AT_const_value : 28
 <2><fbd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x91d33): TIM3_IRQn
    <fc2>   DW_AT_const_value : 29
 <2><fc3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x8e4b8): TIM4_IRQn
    <fc8>   DW_AT_const_value : 30
 <2><fc9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fca>   DW_AT_name        : (indirect string, offset: 0x8e52e): I2C1_EV_IRQn
    <fce>   DW_AT_const_value : 31
 <2><fcf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x9014e): I2C1_ER_IRQn
    <fd4>   DW_AT_const_value : 32
 <2><fd5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x8d0ec): I2C2_EV_IRQn
    <fda>   DW_AT_const_value : 33
 <2><fdb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x8e916): I2C2_ER_IRQn
    <fe0>   DW_AT_const_value : 34
 <2><fe1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x8d0f9): SPI1_IRQn
    <fe6>   DW_AT_const_value : 35
 <2><fe7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe8>   DW_AT_name        : (indirect string, offset: 0x8fb6d): SPI2_IRQn
    <fec>   DW_AT_const_value : 36
 <2><fed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fee>   DW_AT_name        : (indirect string, offset: 0x90fc4): USART1_IRQn
    <ff2>   DW_AT_const_value : 37
 <2><ff3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x8dcfd): USART2_IRQn
    <ff8>   DW_AT_const_value : 38
 <2><ff9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ffa>   DW_AT_name        : (indirect string, offset: 0x86e4d): EXTI15_10_IRQn
    <ffe>   DW_AT_const_value : 40
 <2><fff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1000>   DW_AT_name        : (indirect string, offset: 0x91576): RTC_Alarm_IRQn
    <1004>   DW_AT_const_value : 41
 <2><1005>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1006>   DW_AT_name        : (indirect string, offset: 0x8db51): OTG_FS_WKUP_IRQn
    <100a>   DW_AT_const_value : 42
 <2><100b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <100c>   DW_AT_name        : (indirect string, offset: 0x8ff55): DMA1_Stream7_IRQn
    <1010>   DW_AT_const_value : 47
 <2><1011>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1012>   DW_AT_name        : (indirect string, offset: 0x46da7): SDIO_IRQn
    <1016>   DW_AT_const_value : 49
 <2><1017>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1018>   DW_AT_name        : (indirect string, offset: 0x8edf8): TIM5_IRQn
    <101c>   DW_AT_const_value : 50
 <2><101d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <101e>   DW_AT_name        : (indirect string, offset: 0x9236c): SPI3_IRQn
    <1022>   DW_AT_const_value : 51
 <2><1023>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1024>   DW_AT_name        : (indirect string, offset: 0x90501): DMA2_Stream0_IRQn
    <1028>   DW_AT_const_value : 56
 <2><1029>: Abbrev Number: 1 (DW_TAG_enumerator)
    <102a>   DW_AT_name        : (indirect string, offset: 0x8d134): DMA2_Stream1_IRQn
    <102e>   DW_AT_const_value : 57
 <2><102f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1030>   DW_AT_name        : (indirect string, offset: 0x8f694): DMA2_Stream2_IRQn
    <1034>   DW_AT_const_value : 58
 <2><1035>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1036>   DW_AT_name        : (indirect string, offset: 0x92376): DMA2_Stream3_IRQn
    <103a>   DW_AT_const_value : 59
 <2><103b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <103c>   DW_AT_name        : (indirect string, offset: 0x8ee36): DMA2_Stream4_IRQn
    <1040>   DW_AT_const_value : 60
 <2><1041>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1042>   DW_AT_name        : (indirect string, offset: 0x8fbeb): OTG_FS_IRQn
    <1046>   DW_AT_const_value : 67
 <2><1047>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1048>   DW_AT_name        : (indirect string, offset: 0x91585): DMA2_Stream5_IRQn
    <104c>   DW_AT_const_value : 68
 <2><104d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <104e>   DW_AT_name        : (indirect string, offset: 0x8e19b): DMA2_Stream6_IRQn
    <1052>   DW_AT_const_value : 69
 <2><1053>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1054>   DW_AT_name        : (indirect string, offset: 0x90c62): DMA2_Stream7_IRQn
    <1058>   DW_AT_const_value : 70
 <2><1059>: Abbrev Number: 1 (DW_TAG_enumerator)
    <105a>   DW_AT_name        : (indirect string, offset: 0x8e999): USART6_IRQn
    <105e>   DW_AT_const_value : 71
 <2><105f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1060>   DW_AT_name        : (indirect string, offset: 0x91b18): I2C3_EV_IRQn
    <1064>   DW_AT_const_value : 72
 <2><1065>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1066>   DW_AT_name        : (indirect string, offset: 0x8d4ef): I2C3_ER_IRQn
    <106a>   DW_AT_const_value : 73
 <2><106b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <106c>   DW_AT_name        : (indirect string, offset: 0x8ced6): FPU_IRQn
    <1070>   DW_AT_const_value : 81
 <2><1071>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1072>   DW_AT_name        : (indirect string, offset: 0x8edee): SPI4_IRQn
    <1076>   DW_AT_const_value : 84
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 20 (DW_TAG_base_type)
    <1079>   DW_AT_byte_size   : 1
    <107a>   DW_AT_encoding    : 6	(signed char)
    <107b>   DW_AT_name        : (indirect string, offset: 0x64a4d): signed char
 <1><107f>: Abbrev Number: 6 (DW_TAG_typedef)
    <1080>   DW_AT_name        : (indirect string, offset: 0x91895): IRQn_Type
    <1084>   DW_AT_decl_file   : 3
    <1085>   DW_AT_decl_line   : 133
    <1086>   DW_AT_decl_column : 3
    <1087>   DW_AT_type        : <0xee9>
 <1><108b>: Abbrev Number: 6 (DW_TAG_typedef)
    <108c>   DW_AT_name        : (indirect string, offset: 0x813a): __uint8_t
    <1090>   DW_AT_decl_file   : 4
    <1091>   DW_AT_decl_line   : 43
    <1092>   DW_AT_decl_column : 24
    <1093>   DW_AT_type        : <0x1097>
 <1><1097>: Abbrev Number: 20 (DW_TAG_base_type)
    <1098>   DW_AT_byte_size   : 1
    <1099>   DW_AT_encoding    : 8	(unsigned char)
    <109a>   DW_AT_name        : (indirect string, offset: 0x60c13): unsigned char
 <1><109e>: Abbrev Number: 20 (DW_TAG_base_type)
    <109f>   DW_AT_byte_size   : 2
    <10a0>   DW_AT_encoding    : 5	(signed)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x5179): short int
 <1><10a5>: Abbrev Number: 6 (DW_TAG_typedef)
    <10a6>   DW_AT_name        : (indirect string, offset: 0x6ca85): __uint16_t
    <10aa>   DW_AT_decl_file   : 4
    <10ab>   DW_AT_decl_line   : 57
    <10ac>   DW_AT_decl_column : 25
    <10ad>   DW_AT_type        : <0x10b1>
 <1><10b1>: Abbrev Number: 20 (DW_TAG_base_type)
    <10b2>   DW_AT_byte_size   : 2
